{"talent":{"0":{"name":"Marvelous Sword-Dance (Modified)","field":{"0":{"0":"<strong>Normal Attack</strong><br/>","1":"Performs up to 3 consecutive strikes."},"1":{"0":"<strong>Charged Attack</strong><br/>","1":"Drains Stamina over time to perform continuous spinning attacks against all nearby opponents.<br/>","2":"At the end of the sequence, performs a more powerful slash. "},"2":{"0":"<strong>Plunging Attack</strong><br/>","1":"Plunges from mid-air to strike the ground below, damaging opponents along the path and dealing AoE DMG upon impact."}},"param":["1-Hit DMG","2-Hit DMG","3-Hit DMG","Charged Attack Spinning DMG","Charged Attack Final DMG","Charged Attack Stamina Cost","Max Duration","Plunge DMG","Low Plunge DMG","High Plunge DMG","","","","","","",""]},"1":{"name":"Spirit-Warding Lamp: Troubleshooter Cannon","field":{"0":"Directs a Spirit-Warding Lamp to fire off a Troubleshooter Shot at opponents, dealing <electro>Electro DMG</electro>.<br/>","1":"After the Troubleshooter Shot hits, it will create 2 After-Sales Service Rounds that will automatically track nearby opponents and deal <electro>Electro DMG</electro>.<br/>","2":"<br/>","3":"<i>It is said that Dori can fix any problem for you... for the right price.</i>"},"param":["Troubleshooter Shot DMG","After-Sales Service Round DMG","CD","","","","","","","","","","","","",""]},"3":{"name":"Alcazarzaray's Exactitude","field":{"0":"Summons forth the Jinni within the lamp to give the client various kinds of aid.<br/>","1":"<br/>","2":"<strong>Jinni</strong><br/>","3":"Connects to a nearby character. The connected character will:<br/>","4":[" Continuously restore HP based on Dori's Max HP.<br/>"," Continuously regenerate Energy.<br/>"," Be affected by <electro>Electro</electro>.<br/>"],"5":"When the connector between the Jinni and the character touches opponents, it will deal one instance of <electro>Electro DMG</electro> to them every 0.4s.<br/>","6":"<br/>","7":"Only one Jinni can exist at one time.<br/>","8":"<br/>","9":"<i>\"Hmm? You'll pick this lamp, will you? Oh my, you've got good taste! Unfortunately, there's no price on this treasure — comparable, I'd say, to how you will not sell that mascot by your side for any price in the world.\"</i>"},"param":["Connector DMG","Continuous Healing","Energy Regeneration","Duration","CD","Energy Cost","","","","","","","","","",""]},"4":{"name":"An Eye for Gold","field":{"0":"After a character connected to the <strong>Jinni</strong> triggers an Electro-Charged, Superconduct, Overloaded, Quicken, Aggravate, Hyperbloom, or an Electro Swirl or Crystallize reaction, the CD of <strong>Spirit-Warding Lamp: Troubleshooter Cannon</strong> is decreased by 1s.<br/>","1":"This effect can be triggered once every 3s."},"param":{}},"5":{"name":"Compound Interest","field":{"0":"When the Troubleshooter Shots or After-Sales Service Rounds from <strong>Spirit-Warding Lamp: Troubleshooter Cannon</strong> hit opponents, Dori will restore 5 Elemental Energy for every 100% Energy Recharge possessed.<br/>","1":"Per Spirit-Warding Lamp: Troubleshooter Cannon, only one instance of Energy restoration can be triggered and a maximum of 15 Energy can be restored this way."},"param":{}},"6":{"name":"Unexpected Order","field":{"0":"Has a 25% chance to recover some of the materials used when crafting Character and Weapon Materials."},"param":{}}},"constellation":{"0":{"0":"The number of After-Sales Service Rounds created by <strong>Troubleshooter Shots</strong> is increased by 1."},"1":{"0":"When you are in combat and the <strong>Jinni</strong> heals the character it is connected to, it will fire a Jinni Toop from that character's position that deals 50% of Dori's ATK DMG."},"2":{"0":"Increases the Level of <strong>Alcazarzaray's Exactitude</strong> by 3.<br/>","1":"Maximum upgrade level is 15."},"3":{"0":"The character connected to the <strong>Jinni</strong> will obtain the following buffs based on their current HP and Energy:<br/>","1":["When their HP is lower than 50%, they gain 50% Incoming Healing Bonus.<br/>","When their Energy is less than 50%, they gain 30% Energy Recharge."]},"4":{"0":"Increases the Level of <strong>Spirit-Warding Lamp: Troubleshooter Cannon</strong> by 3.<br/>","1":"Maximum upgrade level is 15."},"5":{"0":"Dori gains the following effects for 3s after using <strong>Spirit-Warding Lamp: Troubleshooter Cannon</strong>:<br/>","1":["<electro>Electro Infusion</electro>.<br/>","When Normal Attacks hit opponents, all nearby party members will heal HP equivalent to 4% of Dori's Max HP. This type of healing can occur once every 0.1s."]}}}