{"talent":{"0":{"name":"Wind Spirit Creation","field":{"0":{"0":"<strong>Normal Attack</strong><br/>","1":"Performs up to 4 attacks using Wind Spirits, dealing <anemo>Anemo DMG</anemo>."},"1":{"0":"<strong>Charged Attack</strong><br/>","1":"Consumes a certain amount of Stamina and deals <anemo>AoE Anemo DMG</anemo> after a short casting time."},"2":{"0":"<strong>Plunging Attack</strong><br/>","1":"Calling upon the power of her Wind Spirits, Sucrose plunges towards the ground from mid-air, damaging all opponents in her path. Deals <anemo>AoE Anemo DMG</anemo> upon impact with the ground."}},"param":["1-Hit DMG","2-Hit DMG","3-Hit DMG","4-Hit DMG","Charged Attack DMG","Charged Attack Stamina Cost","Plunge DMG","Low Plunge DMG","High Plunge DMG","","","","","","","",""]},"1":{"name":"Astable Anemohypostasis Creation - 6308","field":{"0":"Creates a small Wind Spirit that pulls opponents and objects towards its location, launches opponents within its AoE, and deals <anemo>Anemo DMG</anemo>.<br/>","1":"<br/>","2":"<i>This is a little embarrassing, but though the elemental lifeforms birthed through this procedure dissipate very rapidly, they are incredibly useful when adventuring. Even failed experiments can have practical applications.</i>"},"param":["Skill DMG","CD","","","","","","","","","","","","","",""]},"3":{"name":"Forbidden Creation - Isomer 75 / Type II","field":{"0":"Sucrose hurls an unstable concoction that creates a Large Wind Spirit.<br/>","1":"While it persists, the Large Wind Spirit will continuously pull in surrounding opponents and objects, launch nearby opponents, and deal <anemo>Anemo DMG</anemo>.<br/>","2":"<br/>","3":"<strong>Elemental Absorption</strong><br/>","4":"If the Wind Spirit comes into contact with <hydro>Hydro</hydro>/<pyro>Pyro</pyro>/<cryo>Cryo</cryo>/<electro>Electro</electro> energy, it will deal additional elemental DMG of that type.<br/>","5":"Elemental Absorption may only occur once per use.<br/>","6":"<br/>","7":"<i>Sucrose used to give names to her volatile Anemo Hypostases, but their line of heirs quickly grew to surpass Baron Bunny the 893rd.</i>"},"param":["DoT","Additional Elemental DMG","Duration","CD","Energy Cost","","","","","","","","","","",""]},"4":{"name":"Catalyst Conversion","field":{"0":"When Sucrose triggers a Swirl reaction, all characters in the party with the matching element (excluding Sucrose) have their Elemental Mastery increased by 50 for 8s."},"param":{}},"5":{"name":"Mollis Favonius","field":{"0":"When <strong>Astable Anemohypostasis Creation - 6308</strong> or <strong>Forbidden Creation - Isomer 75 / Type II</strong> hits an opponent, increases all party members' (excluding Sucrose) Elemental Mastery by an amount equal to 20% of Sucrose's Elemental Mastery for 8s."},"param":{}},"6":{"name":"Astable Invention","field":{"0":"When Sucrose crafts Character and Weapon Enhancement Materials, she has a 10% chance to obtain double the product."},"param":{}}},"constellation":{"0":{"0":"<strong>Astable Anemohypostasis Creation - 6308</strong> gains 1 additional charge."},"1":{"0":"The duration of <strong>Forbidden Creation - Isomer 75 / Type II</strong> is increased by 2s."},"2":{"0":"Increases the Level of <strong>Astable Anemohypostasis Creation - 6308</strong> by 3.<br/>","1":"Maximum upgrade level is 15."},"3":{"0":"Sucrose will reduce the CD of <strong>Astable Anemohypostasis Creation - 6308</strong> by 1-7s for every 7 Normal or Charged Attack hits she scores against opponents.<br/>","1":"One hit may be counted every 0.1s."},"4":{"0":"Increases the Level of <strong>Forbidden Creation - Isomer 75 / Type II</strong> by 3.<br/>","1":"Maximum upgrade level is 15."},"5":{"0":"If <strong>Forbidden Creation - Isomer 75 / Type II</strong> triggers an Elemental Absorption, all party members gain a 20% Elemental DMG Bonus for the corresponding absorbed element during its duration."}}}