{"talent":{"0":{"name":"Tempered Sword","field":{"0":{"0":"<strong>Normal Attack</strong><br/>","1":"Performs up to 4 consecutive strikes."},"1":{"0":"<strong>Charged Attack</strong><br/>","1":"Drains Stamina over time to perform continuous slashes.<br/>","2":"At the end of the sequence, performs a more powerful slash."},"2":{"0":"<strong>Plunging Attack</strong><br/>","1":"Plunges from mid-air to strike the ground, damaging opponents along the path and dealing AoE DMG upon impact."}},"param":["1-Hit DMG","2-Hit DMG","3-Hit DMG","4-Hit DMG","Charged Attack Cyclic DMG","Charged Attack Final DMG","Charged Attack Stamina Cost","Max Duration","Plunge DMG","Low Plunge DMG","High Plunge DMG","","","","","",""]},"1":{"name":"Searing Onslaught","field":{"0":"Performs a forward slash that deals <pyro>Pyro DMG</pyro>.<br/>","1":"<br/>","2":"This skill can be consecutively used 3 times.<br/>","3":"Enters CD if not cast again within a short period.<br/>","4":"<br/>","5":"<i>The slashes represent the values that Diluc holds dear: one for justice, one for courage, and one for duty.</i>"},"param":["1-Hit DMG","2-Hit DMG","3-Hit DMG","CD","","","","","","","","","","","",""]},"3":{"name":"Dawn","field":{"0":"Releases intense flames to knock back nearby opponents, dealing <pyro>Pyro DMG</pyro>. The flames then converge into the weapon, summoning a Phoenix that flies forward and deals massive <pyro>Pyro DMG</pyro> to all opponents in its path. The Phoenix explodes upon reaching its destination, causing a large amount of <pyro>AoE Pyro DMG</pyro>.<br/>","1":"The searing flames that run down his blade cause it to be infused with <pyro>Pyro</pyro>.<br/>","2":"<br/>","3":"<i>The only reason to walk in the darkness is to light it up. Behold, that fleeing light in the dead of night is the herald of the coming dawn.</i>"},"param":["Slashing DMG","DoT","Explosion DMG","CD","Infusion Duration","Energy Cost","","","","","","","","","",""]},"4":{"name":"Relentless","field":{"0":"Diluc's Charged Attack Stamina Cost is decreased by 50%, and its duration is increased by 3s."},"param":{}},"5":{"name":"Blessing of Phoenix","field":{"0":"The <pyro>Pyro Infusion</pyro> provided by <strong>Dawn</strong> lasts for 4s longer. Additionally, Diluc gains 20% <pyro>Pyro DMG Bonus</pyro> during the duration of this effect."},"param":{}},"6":{"name":"Tradition of the Dawn Knight","field":{"0":"Refunds 15% of the ore used when crafting Claymore-type weapons."},"param":{}}},"constellation":{"0":{"0":"Diluc deals 15% more DMG to opponents whose HP is above 50%."},"1":{"0":"When Diluc takes DMG, his ATK increases by 10% and his ATK SPD increases by 5%. Lasts for 10s.<br/>","1":"This effect can stack up to 3 times and can only occur once every 1.5s."},"2":{"0":"Increases the Level of <strong>Searing Onslaught</strong> by 3.<br/>","1":"Maximum upgrade level is 15."},"3":{"0":"Casting <strong>Searing Onslaught</strong> in rhythm greatly increases damage dealt.<br/>","1":"2s after casting <strong>Searing Onslaught</strong>, casting the next Searing Onslaught in the combo deals 40% additional DMG. This effect lasts for 2s."},"4":{"0":"Increases the Level of <strong>Dawn</strong> by 3.<br/>","1":"Maximum upgrade level is 15."},"5":{"0":"After casting <strong>Searing Onslaught</strong>, the next 2 Normal Attacks within the next 6s will have their DMG and ATK SPD increased by 30%.<br/>","1":"Additionally, Searing Onslaught will not interrupt the Normal Attack combo."}}}