{"talent":{"0":{"name":"Favonius Bladework - Maid","field":{"0":{"0":"<strong>Normal Attack</strong><br/>","1":"Performs up to 4 consecutive strikes."},"1":{"0":"<strong>Charged Attack</strong><br/>","1":"Drains Stamina over time to perform continuous spinning attacks against all nearby opponents.<br/>","2":"At the end of the sequence, performs a more powerful slash. "},"2":{"0":"<strong>Plunging Attack</strong><br/>","1":"Plunges from mid-air to strike the ground below, damaging opponents along the path and dealing AoE DMG upon impact."}},"param":["1-Hit DMG","2-Hit DMG","3-Hit DMG","4-Hit DMG","Charged Attack Cyclic DMG","Charged Attack Final DMG","Charged Attack Stamina Cost","Max Duration","Plunge DMG","Low Plunge DMG","High Plunge DMG","","","","","",""]},"1":{"name":"Breastplate","field":{"0":"Summons protective stone armor, dealing <geo>Geo DMG</geo> to surrounding opponents and creating a shield. The shield's DMG Absorption scales based on Noelle's DEF.<br/>","1":"The shield has the following properties:<br/>","2":["When Noelle's Normal and Charged Attacks hit a target, they have a certain chance to regenerate HP for all characters.<br/>","Possesses 150% DMG Absorption efficiency against all Elemental and Physical DMG.<br/>"],"3":"<br/>","4":"The amount of HP healed when regeneration is triggered scales based on Noelle's DEF.<br/>","5":"<br/>","6":"<i>Noelle is both a dutiful maid and a valiant knight.</i>"},"param":["Skill DMG","DMG Absorption","Healing","Healing Triggering Chance","Duration","CD","","","","","","","","","",""]},"3":{"name":"Sweeping Time","field":{"0":"Gathering the strength of stone around her weapon, Noelle strikes the opponents surrounding her within a large AoE, dealing <geo>Geo DMG</geo>.<br/>","1":"Afterwards, Noelle gains the following effects:<br/>","2":["Larger attack AoE.<br/>","Converts attack DMG to <geo>Geo DMG</geo> that cannot be overridden by any other elemental infusion.<br/>","Increased ATK that scales based on her DEF.<br/>"],"3":"<br/>","4":"<i>Sometimes, it's not just dust that needs sweeping...</i>"},"param":["Burst DMG","Skill DMG","ATK Bonus","Duration","CD","Energy Cost","","","","","","","","","",""]},"4":{"name":"Devotion","field":{"0":"When Noelle is in the party but not on the field, this ability triggers automatically when your active character's HP falls below 30%:<br/>","1":"Creates a shield for your active character that lasts for 20s and absorbs DMG equal to 400% of Noelle's DEF.<br/>","2":"The shield has a 150% DMG Absorption effectiveness against all Elemental and Physical DMG.<br/>","3":"This effect can only occur once every 60s."},"param":{}},"5":{"name":"Nice and Clean","field":{"0":"Noelle will decrease the CD of <strong>Breastplate</strong> by 1s for every 4 Normal or Charged Attack hits she scores on opponents.<br/>","1":"One hit may be counted every 0.1s."},"param":{}},"6":{"name":"Maid's Knighthood","field":{"0":"When a Perfect Cooking is achieved on a DEF-boosting dish, Noelle has a 12% chance to obtain double the product."},"param":{}}},"constellation":{"0":{"0":"While <strong>Sweeping Time</strong> and <strong>Breastplate</strong> are both in effect, the chance of Breastplate's healing effects activating is increased to 100%."},"1":{"0":"Decreases the Stamina Consumption of Noelle's Charged Attacks by 20% and increases her Charged Attack DMG by 15%."},"2":{"0":"Increases the Level of <strong>Breastplate</strong> by 3.<br/>","1":"Maximum upgrade level is 15."},"3":{"0":"When <strong>Breastplate</strong>'s duration expires or it is destroyed by DMG, it will deal 400% ATK of <geo>Geo DMG</geo> to surrounding opponents."},"4":{"0":"Increases the Level of <strong>Sweeping Time</strong> by 3.<br/>","1":"Maximum upgrade level is 15."},"5":{"0":"<strong>Sweeping Time</strong> increases Noelle's ATK by an additional 50% of her DEF.<br/>","1":"Additionally, every opponent defeated during the skill's duration adds 1s to the duration, up to 10s."}}}