{"talent":{"0":{"name":"Steel Fang","field":{"0":{"0":"<strong>Normal Attack</strong><br/>","1":"Performs up to 4 consecutive strikes."},"1":{"0":"<strong>Charged Attack</strong><br/>","1":"Drains Stamina over time to perform continuous spinning attacks against all nearby opponents.<br/>","2":"At the end of the sequence, performs a more powerful slash. "},"2":{"0":"<strong>Plunging Attack</strong><br/>","1":"Plunges from mid-air to strike the ground below, damaging opponents along the path and dealing AoE DMG upon impact."}},"param":["1-Hit DMG","2-Hit DMG","3-Hit DMG","4-Hit DMG","Charged Attack Cyclic DMG","Charged Attack Final DMG","Charged Attack Stamina Cost","Max Duration","Plunge DMG","Low Plunge DMG","High Plunge DMG","","","","","",""]},"1":{"name":"Claw and Thunder","field":{"0":"#Hunts his prey using the techniques taught to him by his master and his lupical.<br/>","1":"<br/>","2":"<strong>{LAYOUT_MOBILE#Tap}{LAYOUT_PC#Press}{LAYOUT_PS#Press}</strong><br/>","3":"Swings the Thunder Wolf Claw, dealing <electro>Electro DMG</electro> to opponents in front of Razor.<br/>","4":"Upon striking an opponent, Razor will gain an Electro Sigil, which increases his Energy Recharge rate.<br/>","5":"Razor can have up to 3 Electro Sigils simultaneously, and gaining a new Electro Sigil refreshes their duration.<br/>","6":"<br/>","7":"<strong>Hold</strong><br/>","8":"Gathers Electro energy to unleash a lightning storm over a small AoE, causing massive <electro>Electro DMG</electro>, and clears all of Razor's Electro Sigils.<br/>","9":"Each Electro Sigil cleared in this manner will be converted into Energy for Razor.<br/>","10":"<br/>","11":"<i>In the moment when lightning strikes, you can sometimes glimpse the look of a predator sizing up his prey deep within Razor's eyes.</i>"},"param":["#{LAYOUT_MOBILE#Tapping}{LAYOUT_PC#Press}{LAYOUT_PS#Press} Skill DMG","Hold Skill DMG","Energy Recharge Bonus","Energy Regenerated","Electro Sigil duration","#{LAYOUT_MOBILE#Tapping}{LAYOUT_PC#Press}{LAYOUT_PS#Press} CD","CD (hold)","","","","","","","","",""]},"3":{"name":"Lightning Fang","field":{"0":"Summons the Wolf Within, which deals <electro>Electro DMG</electro> to all nearby opponents. This clears all of Razor's Electro Sigils, which will be converted into Elemental Energy for him.<br/>","1":"The Wolf Within will fight alongside Razor for the skill's duration.<br/>","2":"<br/>","3":"<strong>The Wolf Within</strong><br/>","4":["Strikes alongside Razor's normal attacks, dealing <electro>Electro DMG</electro>.<br/>","Raises Razor's ATK SPD and <electro>Electro RES</electro>.<br/>","Causes Razor to be immune to DMG inflicted by the <electro>Electro-Charged</electro> status.<br/>","Disables Razor's Charged Attacks.<br/>","Increases Razor's resistance to interruption.<br/>"],"5":"<br/>","6":"These effects end when Razor leaves the battlefield.<br/>","7":"When Razor leaves the field, a maximum of 10 Energy will be returned to him based off the duration remaining on this skill.<br/>","8":"<br/>","9":"<i>The wolf has awoken. The hunt is on.</i>"},"param":["Burst DMG","Soul Companion DMG","Normal ATK SPD Bonus","Electro RES Bonus","Duration","CD","Energy Cost","","","","","","","","",""]},"4":{"name":"Awakening","field":{"0":"Decreases <strong>Claw and Thunder</strong>'s CD by 18%.<br/>","1":"Using <strong>Lightning Fang</strong> resets the CD of <strong>Claw and Thunder</strong>."},"param":{}},"5":{"name":"Hunger","field":{"0":"When Razor's Energy is below 50%, increases Energy Recharge by 30%."},"param":{}},"6":{"name":"Wolvensprint","field":{"0":"Decreases sprinting Stamina consumption for your own party members by 20%.<br/>","1":"Not stackable with Passive Talents that provide the exact same effects."},"param":{}}},"constellation":{"0":{"0":"Picking up an Elemental Orb or Particle increases Razor's DMG by 10% for 8s."},"1":{"0":"Increases CRIT Rate against opponents with less than 30% HP by 10%."},"2":{"0":"Increases the Level of <strong>Lightning Fang</strong> by 3.<br/>","1":"Maximum upgrade level is 15."},"3":{"0":"#When casting <strong>Claw and Thunder</strong> ({LAYOUT_MOBILE#Tap}{LAYOUT_PC#Press}{LAYOUT_PS#Press}), opponents hit will have their DEF decreased by 15% for 7s."},"4":{"0":"Increases the Level of <strong>Claw and Thunder</strong> by 3.<br/>","1":"Maximum upgrade level is 15."},"5":{"0":"Every 10s, Razor's sword charges up, causing the next Normal Attack to release lightning that deals 100% of Razor's ATK as <electro>Electro DMG</electro>.<br/>","1":"When Razor is not using <strong>Lightning Fang</strong>, a lightning strike on an opponent will grant Razor an Electro Sigil for <strong>Claw and Thunder</strong>."}}}