{"talent":{"0":{"name":"Divine Marksmanship","field":{"0":{"0":"<strong>Normal Attack</strong><br/>","1":"Performs up to 6 consecutive shots with a bow."},"1":{"0":"<strong>Charged Attack</strong><br/>","1":"Performs a more precise <strong>Aimed Shot</strong> with increased DMG.<br/>","2":"While aiming, favorable winds will accumulate on the arrowhead. A fully charged wind arrow will deal <anemo>Anemo DMG</anemo>."},"2":{"0":"<strong>Plunging Attack</strong><br/>","1":"Fires off a shower of arrows in mid-air before falling and striking the ground, dealing AoE DMG upon impact."}},"param":["1-Hit DMG","2-Hit DMG","3-Hit DMG","4-Hit DMG","5-Hit DMG","6-Hit DMG","Aimed Shot","Fully-Charged Aimed Shot","Plunge DMG","Low Plunge DMG","High Plunge DMG","","","","","",""]},"1":{"name":"Skyward Sonnet","field":{"0":"#O wind upon which all hymns and songs fly, bear these earth-walkers up into the sky!<br/>","1":"<br/>","2":"<strong>{LAYOUT_MOBILE#Tap}{LAYOUT_PC#Press}{LAYOUT_PS#Press}</strong><br/>","3":"Summons a Wind Domain at the opponent's location, dealing <anemo>AoE Anemo DMG</anemo> and launching opponents into the air.<br/>","4":"<br/>","5":"<strong>Hold</strong><br/>","6":"Summons an even larger Wind Domain with Venti as the epicenter, dealing <anemo>AoE Anemo DMG</anemo> and launching affected opponents into the air.<br/>","7":"After unleashing the Hold version of this ability, Venti rides the wind into the air.<br/>","8":"<br/>","9":"Opponents hit by Skyward Sonnet will fall to the ground slowly.<br/>","10":"<br/>","11":"<i>In the days when gods and men walked the earth together, the heavens were filled with countless songs. This melody has long since been forgotten.</i>"},"param":["#{LAYOUT_MOBILE#Tapping}{LAYOUT_PC#Press}{LAYOUT_PS#Press} DMG","#{LAYOUT_MOBILE#Tapping}{LAYOUT_PC#Press}{LAYOUT_PS#Press} CD","Hold DMG","CD (hold)","","","","","","","","","","","",""]},"3":{"name":"Wind's Grand Ode","field":{"0":"Fires off an arrow made of countless coalesced winds, creating a huge Stormeye that sucks in opponents and deals continuous <anemo>Anemo DMG</anemo>.<br/>","1":"<br/>","2":"<strong>Elemental Absorption</strong><br/>","3":"If the Stormeye comes into contact with <hydro>Hydro</hydro>/<pyro>Pyro</pyro>/<cryo>Cryo</cryo>/<electro>Electro</electro>, it will deal additional elemental DMG of that type.<br/>","4":"Elemental Absorption may only occur once per use.<br/>","5":"<br/>","6":"<i>Many hymns written in praise of the Anemo Archon have been lost to time. This one sings of his mastery over the wind.</i>"},"param":["DoT","Additional Elemental DMG","Duration","CD","Energy Cost","","","","","","","","","","",""]},"4":{"name":"Embrace of Winds","field":{"0":"Holding <strong>Skyward Sonnet</strong> creates an upcurrent that lasts for 20s."},"param":{}},"5":{"name":"Stormeye","field":{"0":"Regenerates 15 Energy for Venti after the effects of <strong>Wind's Grand Ode</strong> end.<br/>","1":"If an Elemental Absorption occurred, this also restores 15 Energy to all characters of that corresponding element in the party."},"param":{}},"6":{"name":"Windrider","field":{"0":"Decreases gliding Stamina consumption for your own party members by 20%.<br/>","1":"Not stackable with Passive Talents that provide the exact same effects."},"param":{}}},"constellation":{"0":{"0":"Fires 2 additional arrows per <strong>Aimed Shot</strong>, each dealing 33% of the original arrow's DMG."},"1":{"0":"<strong>Skyward Sonnet</strong> decreases opponents' <anemo>Anemo RES</anemo> and Physical RES by 12% for 10s.<br/>","1":"Opponents launched by <strong>Skyward Sonnet</strong> suffer an additional 12% <anemo>Anemo RES</anemo> and Physical RES decrease while airborne."},"2":{"0":"Increases the Level of <strong>Wind's Grand Ode</strong> by 3.<br/>","1":"Maximum upgrade level is 15."},"3":{"0":"When Venti picks up an Elemental Orb or Particle, he receives a 25% <anemo>Anemo DMG Bonus</anemo> for 10s."},"4":{"0":"Increases the Level of <strong>Skyward Sonnet</strong> by 3.<br/>","1":"Maximum upgrade level is 15."},"5":{"0":"Targets who take DMG from <strong>Wind's Grand Ode</strong> have their <anemo>Anemo RES</anemo> decreased by 20%.<br/>","1":"If an Elemental Absorption occurred, then their RES towards the corresponding Element is also decreased by 20%."}}}