{"talent":{"0":{"name":"Oceanborne","field":{"0":{"0":"<strong>Normal Attack</strong><br/>","1":"Performs up to 5 consecutive strikes."},"1":{"0":"<strong>Charged Attack</strong><br/>","1":"Drains Stamina over time to perform continuous slashes.<br/>","2":"At the end of the sequence, performs a more powerful slash."},"2":{"0":"<strong>Plunging Attack</strong><br/>","1":"Plunges from mid-air to strike the ground, damaging opponents along the path and dealing AoE DMG upon impact."}},"param":["1-Hit DMG","2-Hit DMG","3-Hit DMG","4-Hit DMG","5-Hit DMG","Charged Attack Cyclic DMG","Charged Attack Final DMG","Charged Attack Stamina Cost","Max Duration","Plunge DMG","Low Plunge DMG","High Plunge DMG","","","","",""]},"1":{"name":"Tidecaller","field":{"0":"#Nothing to worry about. Should anyone raise a hand against her or her men, she will avenge it ten-fold with sword and thunder.<br/>","1":"<br/>","2":"<strong>{LAYOUT_MOBILE#Tap}{LAYOUT_PC#Press}{LAYOUT_PS#Press}</strong><br/>","3":"Accumulating the power of lightning, Beidou swings her blade forward fiercely, dealing <electro>Electro DMG</electro>.<br/>","4":"<br/>","5":"<strong>Hold</strong><br/>","6":"Lifts her weapon up as a shield. Max DMG absorbed scales off Beidou's Max HP.<br/>","7":"Attacks using the energy stored within the greatsword upon release or once this ability's duration expires, dealing <electro>Electro DMG</electro>. DMG dealt scales with the number of times Beidou is attacked in the skill's duration. The greatest DMG Bonus will be attained once this effect is triggered twice.<br/>","8":"The shield possesses the following properties:<br/>","9":["Has 250% <electro>Electro DMG</electro> Absorption Efficiency.<br/>","Applies the <electro>Electro element</electro> to Beidou upon activation.<br/>"],"10":"<br/>","11":"<i>Conquer the high seas! Pursue the waves and chase the storm!</i>"},"param":["Shield DMG Absorption","Base DMG","DMG Bonus on Hit Taken","CD","","","","","","","","","","","",""]},"3":{"name":"Stormbreaker","field":{"0":"Recalling her slaying of the great beast Haishan, Beidou calls upon that monstrous strength and the lightning to create a Thunderbeast's Targe around herself, dealing <electro>Electro DMG</electro> to nearby opponents.<br/>","1":"<br/>","2":"<strong>Thunderbeast's Targe</strong><br/>","3":["When Normal and Charged Attacks hit, they create a lightning discharge that can jump between opponents, dealing <electro>Electro DMG</electro>.<br/>","Increases the character's resistance to interruption, and decreases DMG taken.<br/>"],"4":"<br/>","5":"A maximum of 1 lightning discharge can be triggered per second.<br/>","6":"<br/>","7":"<i>With a peal of thunder, Haishan is slain.</i>"},"param":["Skill DMG","Lightning DMG","DMG Reduction","Duration","CD","Energy Cost","","","","","","","","","",""]},"4":{"name":"Retribution","field":{"0":"Counterattacking with <strong>Tidecaller</strong> at the precise moment when the character is hit grants the maximum DMG Bonus."},"param":{}},"5":{"name":"Lightning Storm","field":{"0":"Gain the following effects for 10s after unleashing <strong>Tidecaller</strong> with its maximum DMG Bonus: <br/>","1":["DMG dealt by Normal and Charged Attacks is increased by 15%. ATK SPD of Normal and Charged Attacks is increased by 15%.<br/>","Greatly reduced delay before unleashing Charged Attacks."]},"param":{}},"6":{"name":"Conqueror of Tides","field":{"0":"Decreases swimming Stamina consumption for your own party members by 20%.<br/>","1":"Not stackable with Passive Talents that provide the exact same effects."},"param":{}}},"constellation":{"0":{"0":"When <strong>Stormbreaker</strong> is used:<br/>","1":"Creates a shield that absorbs up to 16% of Beidou's Max HP for 15s.<br/>","2":"This shield absorbs <electro>Electro DMG</electro> 250% more effectively."},"1":{"0":"<strong>Stormbreaker</strong>'s arc lightning can jump to 2 additional targets."},"2":{"0":"Increases the Level of <strong>Tidecaller</strong> by 3.<br/>","1":"Maximum upgrade level is 15."},"3":{"0":"Upon being attacked, Beidou's Normal Attacks gain an additional instance of 20% <electro>Electro DMG</electro> for 10s."},"4":{"0":"Increases the Level of <strong>Stormbreaker</strong> by 3.<br/>","1":"Maximum upgrade level is 15."},"5":{"0":"During the duration of <strong>Stormbreaker</strong>, the <electro>Electro RES</electro> of surrounding opponents is decreased by 15%."}}}