{"talent":{"0":{"name":"Kätzlein Style","field":{"0":{"0":"<strong>Normal Attack</strong><br/>","1":"Performs up to 5 consecutive shots with a bow."},"1":{"0":"<strong>Charged Attack</strong><br/>","1":"Performs a more precise <strong>Aimed Shot</strong> with increased DMG.<br/>","2":"While aiming, biting frost will accumulate on the arrowhead. A fully charged frost arrow will deal <cryo>Cryo DMG</cryo>."},"2":{"0":"<strong>Plunging Attack</strong><br/>","1":"Fires off a shower of arrows in mid-air before falling and striking the ground, dealing AoE DMG upon impact."}},"param":["1-Hit DMG","2-Hit DMG","3-Hit DMG","4-Hit DMG","5-Hit DMG","Aimed Shot","Fully-Charged Aimed Shot","Plunge DMG","Low Plunge DMG","High Plunge DMG","","","","","","",""]},"1":{"name":"Icy Paws","field":{"0":"#Fires an Icy Paw that deals <cryo>Cryo DMG</cryo> to opponents and forms a shield on hit.<br/>","1":"The shield's DMG Absorption scales based on Diona's Max HP, and its duration scales off the number of Icy Paws that hit their target.<br/>","2":"<br/>","3":"<strong>{LAYOUT_MOBILE#Tap}{LAYOUT_PC#Press}{LAYOUT_PS#Press}</strong><br/>","4":"Rapidly fires off 2 Icy Paws.<br/>","5":"<br/>","6":"<strong>Hold</strong><br/>","7":"Dashes back quickly before firing 5 Icy Paws.<br/>","8":"The shield created by a Hold attack will gain a 75% DMG Absorption Bonus.<br/>","9":"<br/>","10":"The shield has a 250% <cryo>Cryo DMG</cryo> Absorption Bonus, and will cause your active character to become affected by <cryo>Cryo</cryo> at the point of formation for a short duration.<br/>","11":"<br/>","12":"<i>When she first started bartending, Diona found that no matter how much ice she put in her cocktails, it would never do a drunkard any harm. That all changed when she received her Vision — now she can form ice cold enough to cause severe brainfreeze. Five out of five stars!</i>"},"param":["Icy Paw DMG","Base Shield DMG Absorption","Duration","#{LAYOUT_MOBILE#Tapping}{LAYOUT_PC#Press}{LAYOUT_PS#Press} CD","Holding CD","","","","","","","","","","",""]},"3":{"name":"Signature Mix","field":{"0":"Tosses out a special cold brew that deals <cryo>AoE Cryo DMG</cryo> and creates a Drunken Mist in an AoE.<br/>","1":"<br/>","2":"<strong>Drunken Mist</strong><br/>","3":["Deals continuous <cryo>Cryo DMG</cryo> to opponents within the AoE.<br/>","Continuously regenerates the HP of characters within the AoE.<br/>"],"4":"<br/>","5":"<i>A horrific mix that even Diona considers inhumane. The horrifying foretaste should be left for one's opponents. It has a crisp aftertaste, but unfortunately, one can only feel it on one's nose and skin.</i>"},"param":["Skill DMG","Continuous Field DMG","HP Regeneration Over Time","Duration","CD","Energy Cost","","","","","","","","","",""]},"4":{"name":"Cat's Tail Secret Menu","field":{"0":"Characters shielded by <strong>Icy Paws</strong> have their Movement SPD increased by 10% and their Stamina Consumption decreased by 10%."},"param":{}},"5":{"name":"Drunkards' Farce","field":{"0":"Opponents who enter the AoE of <strong>Signature Mix</strong> have 10% decreased ATK for 15s."},"param":{}},"6":{"name":"Complimentary Bar Food","field":{"0":"When a Perfect Cooking is achieved on a dish with restorative effects, there is a 12% chance to obtain double the product."},"param":{}}},"constellation":{"0":{"0":"Regenerates 15 Energy for Diona after the effects of <strong>Signature Mix</strong> end."},"1":{"0":"Increases <strong>Icy Paws</strong>' DMG by 15%, and increases its shield's DMG Absorption by 15%.<br/>","1":"Additionally, when paws hit their targets, creates a shield for other nearby characters on the field with 50% of the <strong>Icy Paws</strong> shield's DMG Absorption for 5s."},"2":{"0":"Increases the Level of <strong>Signature Mix</strong> by 3.<br/>","1":"Maximum upgrade level is 15."},"3":{"0":"Within the radius of <strong>Signature Mix</strong>, Diona's charge time for aimed shots is reduced by 60%"},"4":{"0":"Increases the Level of <strong>Icy Paws</strong> by 3.<br/>","1":"Maximum upgrade level is 15."},"5":{"0":"Characters within <strong>Signature Mix</strong>'s radius will gain the following effects based on their HP amounts:<br/>","1":["Increases Incoming Healing Bonus by 30% when HP falls below or is equal to 50%.<br/>","Elemental Mastery increased by 200 when HP is above 50%."]}}}