{"talent":{"0":{"name":"Strike of Fortune","field":{"0":{"0":"<strong>Normal Attack</strong><br/>","1":"Performs up to 5 rapid strikes."},"1":{"0":"<strong>Charged Attack</strong><br/>","1":"Consumes a certain amount of Stamina to unleash 2 rapid sword strikes."},"2":{"0":"<strong>Plunging Attack</strong><br/>","1":"Plunges from mid-air to strike the ground below, damaging opponents along the path and dealing AoE DMG upon impact."}},"param":["1-Hit DMG","2-Hit DMG","3-Hit DMG","4-Hit DMG","5-Hit DMG","Charged Attack DMG","Charged Attack Stamina Cost","Plunge DMG","Low Plunge DMG","High Plunge DMG","","","","","","",""]},"1":{"name":"Passion Overload","field":{"0":"#Bennett puts all his fire and passion for adventuring into his sword. Results may vary based on how fired up he is...<br/>","1":"<br/>","2":"<strong>{LAYOUT_MOBILE#Tap}{LAYOUT_PC#Press}{LAYOUT_PS#Press}</strong><br/>","3":"A single, swift flame strike that deals <pyro>Pyro DMG</pyro>.<br/>","4":"<br/>","5":"<strong>Hold (Short)</strong><br/>","6":"Charges up, resulting in different effects when unleashed based on the Charge Level.<br/>","7":["Level 1: Strikes twice, dealing <pyro>Pyro DMG</pyro> and launching opponents.<br/>","Level 2: Unleashes 3 consecutive attacks that deal impressive <pyro>Pyro DMG</pyro>, but the last attack triggers an explosion that launches both Bennett and the enemy.<br/>"],"8":"Bennett takes no damage from being launched.<br/>","9":"<br/>","10":"<i>An attack that combines Bennett's dreams and passion with Pyro. But passion is sometimes overblown, and Pyro sometimes blows over.</i>"},"param":["#{LAYOUT_MOBILE#Tapping}{LAYOUT_PC#Press}{LAYOUT_PS#Press} DMG","Charge Level 1 DMG","Charge Level 2 DMG","Explosion DMG","CD","","","","","","","","","","",""]},"3":{"name":"Fantastic Voyage","field":{"0":"Bennett performs a jumping attack that deals <pyro>Pyro DMG</pyro>, creating an Inspiration Field.<br/>","1":"<br/>","2":"<strong>Inspiration Field</strong><br/>","3":["If the health of a character within the AoE is equal to or falls below 70%, their health will continuously regenerate. The amount of HP restored scales off Bennett's Max HP.<br/>","If the health of a character within the AoE is higher than 70%, they gain an ATK Bonus that is based on Bennett's Base ATK.<br/>","Imbues characters within the AoE with <pyro>Pyro</pyro>.<br/>"],"4":"<br/>","5":"<i>Benny's Adventure Team's adventures are always fraught with unexpected danger. However, Bennett is more inclined to call them \"journeys full of wonder, excitement, and beauty.\"</i>"},"param":["Skill DMG","Continuous Regeneration Per Sec","ATK Bonus Ratio","Duration","CD","Energy Cost","","","","","","","","","",""]},"4":{"name":"Rekindle","field":{"0":"Decreases <strong>Passion Overload</strong>'s CD by 20%."},"param":{}},"5":{"name":"Fearnaught","field":{"0":"Within the area created by <strong>Fantastic Voyage</strong>, <strong>Passion Overload</strong> takes on the following effects:<br/>","1":["CD is reduced by 50%.<br/>","Bennett will not be launched by the effects of Charge Level 2."]},"param":{}},"6":{"name":"It Should Be Safe...","field":{"0":"When dispatched on an expedition in Mondstadt, time consumed is reduced by 25%."},"param":{}}},"constellation":{"0":{"0":"<strong>Fantastic Voyage</strong>'s ATK increase no longer has an HP restriction, and gains an additional 20% of Bennett's Base ATK."},"1":{"0":"When Bennett's HP falls below 70%, his Energy Recharge is increased by 30%."},"2":{"0":"Increases the Level of <strong>Passion Overload</strong> by 3.<br/>","1":"Maximum upgrade level is 15."},"3":{"0":"Using a Normal Attack when executing the second attack of <strong>Passion Overload</strong>'s Charge Level 1 allows an additional attack to be performed.<br/>","1":"This additional attack does 135% of the second attack's DMG."},"4":{"0":"Increases the Level of <strong>Fantastic Voyage</strong> by 3.<br/>","1":"Maximum upgrade level is 15."},"5":{"0":"Sword, Claymore, or Polearm-wielding characters inside <strong>Fantastic Voyage</strong>'s radius gain a 15% <pyro>Pyro DMG Bonus</pyro> and their weapons are infused with <pyro>Pyro</pyro>."}}}