{"talent":{"0":{"name":"Swiftshatter Spear","field":{"0":{"0":"<strong>Normal Attack</strong><br/>","1":"Performs up to 4 consecutive spear strikes."},"1":{"0":"<strong>Charged Attack</strong><br/>","1":"Consumes a certain amount of Stamina to lunge forward, dealing damage to opponents along the way."},"2":{"0":"<strong>Plunging Attack</strong><br/>","1":"Plunges from mid-air to strike the ground below, damaging opponents along the path and dealing AoE DMG upon impact."}},"param":["1-Hit DMG","2-Hit DMG","3-Hit DMG","4-Hit DMG","Charged Attack DMG","Charged Attack Stamina Cost","Plunge DMG","Low Plunge DMG","High Plunge DMG","","","","","","","",""]},"1":{"name":"Blazing Blessing","field":{"0":"Thoma vaults forward with his polearm and delivers a flame-filled flying kick that deals <pyro>AoE Pyro DMG</pyro>, while also summoning a defensive Blazing Barrier. At the moment of casting, Thoma's Elemental Skill applies <pyro>Pyro</pyro> to himself.<br/>","1":"The DMG Absorption of the Blazing Barrier scales off Thoma's Max HP.<br/>","2":"The Blazing Barrier has the following traits:<br/>","3":["Absorbs <pyro>Pyro DMG</pyro> 250% more effectively.<br/>","When a new Blazing Barrier is obtained, the remaining DMG Absorption of an existing Blazing Barrier will stack and its duration will be refreshed.<br/>"],"4":"<br/>","5":"The maximum DMG Absorption of the Blazing Barrier will not exceed a certain percentage of Thoma's Max HP.<br/>","6":"<br/>","7":"<i>As a guest from afar, only the most burning passion would allow one to master the pure and precise spear arts of Inazuma. Thoma's mastery, indeed, is not limited to being the \"swiftest-studying student\" or \"a master of the spear,\" but he has imbued his will to protect others and fend off foes into his art as well.</i>"},"param":["Skill DMG","Shield DMG Absorption","Shield Duration","Max Shield DMG Absorption","CD","","","","","","","","","","",""]},"3":{"name":"Crimson Ooyoroi","field":{"0":"Thoma spins his polearm, slicing at his foes with roaring flames that deal <pyro>AoE Pyro DMG</pyro> and weave themselves into a Scorching Ooyoroi.<br/>","1":"<br/>","2":"<strong>Scorching Ooyoroi</strong><br/>","3":"While Scorching Ooyoroi is in effect, the active character's Normal Attacks will trigger Fiery Collapse, dealing <pyro>AoE Pyro DMG</pyro> and summoning a Blazing Barrier.<br/>","4":"Fiery Collapse can be triggered once every 1s.<br/>","5":"<br/>","6":"Except for the amount of DMG they can absorb, the Blazing Barriers created in this way are identical to those created by Thoma's Elemental Skill, Blazing Blessing:<br/>","7":["Absorbs <pyro>Pyro DMG</pyro> 250% more effectively.<br/>","When a new Blazing Barrier is obtained, the remaining DMG Absorption of an existing Blazing Barrier will stack and its duration will be refreshed.<br/>"],"8":"<br/>","9":"The maximum DMG Absorption of the Blazing Barrier will not exceed a certain percentage of Thoma's Max HP.<br/>","10":"<br/>","11":"If Thoma falls, the effects of Scorching Ooyoroi will be cleared.<br/>","12":"<br/>","13":"<i>\"I will not forget my initial promise. Let this burning flame protect those I cherish, and may it never be extinguished.\"</i>"},"param":["Skill DMG","Fiery Collapse DMG","Shield DMG Absorption","Shield Duration","Scorching Ooyoroi Duration","CD","Energy Cost","","","","","","","","",""]},"4":{"name":"Imbricated Armor","field":{"0":"When your current active character obtains or refreshes a <strong>Blazing Barrier</strong>, this character's Shield Strength will increase by 5% for 6s.<br/>","1":"This effect can be triggered once every 0.3s seconds. Max 5 stacks."},"param":{}},"5":{"name":"Flaming Assault","field":{"0":"DMG dealt by <strong>Crimson Ooyoroi</strong>'s Fiery Collapse is increased by 2.2% of Thoma's Max HP."},"param":{}},"6":{"name":"Snap and Swing","field":{"0":"When you <strong>fish</strong> successfully in Inazuma, Thoma's help grants a 20% chance of scoring a double catch."},"param":{}}},"constellation":{"0":{"0":"When a character protected by Thoma's own <strong>Blazing Barrier</strong> (Thoma excluded) is attacked, Thoma's own <strong>Blazing Blessing</strong> CD is decreased by 3s, while his own <strong>Crimson Ooyoroi</strong>'s CD is decreased by 3s.<br/>","1":"This effect can be triggered once every 20s."},"1":{"0":"<strong>Crimson Ooyoroi</strong>'s duration is increased by 3s."},"2":{"0":"Increases the Level of <strong>Blazing Blessing</strong> by 3.<br/>","1":"Maximum upgrade level is 15."},"3":{"0":"After using <strong>Crimson Ooyoroi</strong>, 15 Energy will be restored to Thoma."},"4":{"0":"Increases the Level of <strong>Crimson Ooyoroi</strong> by 3.<br/>","1":"Maximum upgrade level is 15."},"5":{"0":"When a <strong>Blazing Barrier</strong> is obtained or refreshed, the DMG dealt by all party members' Normal, Charged, and Plunging Attacks is increased by 15% for 6s."}}}