{"talent":{"0":{"name":"Cloud-Grazing Strike","field":{"0":{"0":"<strong>Normal Attack</strong><br/>","1":"Melancarkan hingga 5 serangan berturut-turut."},"1":{"0":"<strong>Charged Attack</strong><br/>","1":"Mengonsumsi sejumlah Stamina untuk menerjang ke depan, mengakibatkan DMG pada musuh di jalurnya."},"2":{"0":"<strong>Plunging Attack</strong><br/>","1":"Menerjang dari udara untuk menghantam tanah, menyerang musuh di jalur terjangan dan mengakibatkan DMG area saat mendarat."}},"param":["DMG Tahap 1","DMG Tahap 2","DMG Tahap 3","DMG Tahap 4","DMG Tahap 5","DMG Charged Attack","Konsumsi Stamina Charged Attack","DMG Selama Plunging","DMG Plunging Attack Min./Maks.","","","","","","",""]},"1":{"name":"Opening Flourish","field":{"0":"Yun Jin dapat menggunakan kuda-kuda bela dirinya untuk melawan para musuh.<br/>","1":"<br/>","2":"<strong>Mode Tekan</strong><br/>","3":"Memutar tombak dengan kuda-kuda pembelah awan dan mengakibatkan <geo>Geo DMG</geo>.<br/>","4":"<br/>","5":"<strong>Mode Tahan</strong><br/>","6":"Memasang kuda-kuda Opening Flourish dan melakukan charge untuk menciptakan sebuah perisai. Jumlah DMG yang dapat ditahan perisai didasarkan pada Max HP Yun Jin dan memiliki 150% efek penahanan terhadap semua Elemental DMG dan Physical DMG. Perisai akan berakhir saat Elemental Skill selesai dilancarkan.<br/>","7":"Saat melancarkan skill dengan melepas tombol, durasinya berakhir, atau perisainya hancur, Yun Jin akan menyerang dengan ayunan tombaknya dan melepaskan energi yang tersimpan untuk mengakibatkan <geo>Geo DMG</geo>.<br/>","8":"Yun Jin akan melancarkan serangan Charge Tahap 1 atau Charge Tahap 2 berdasarkan durasi charge-nya.<br/>","9":"<br/>","10":"<i>Di balik satu momen kejayaan di atas panggung, terdapat kerja keras selama sepuluh tahun.</i>"},"param":["DMG Mode Tekan","DMG Charge Tahap 1","DMG Charge Tahap 2","Pertahanan Perisai","Cooldown","","","","","","","","","","",""]},"3":{"name":"Cliffbreaker's Banner","field":{"0":"Mengakibatkan <geo>Geo DMG Area</geo> dan memberikan efek Flying Cloud Flag Formation kepada seluruh anggota party di sekitar.<br/>","1":"<br/>","2":"<strong>Flying Cloud Flag Formation</strong><br/>","3":"Saat mengakibatkan DMG kepada musuh dengan Normal Attack, DMG yang diakibatkan akan meningkat sesuai dengan DEF Yun Jin saat ini.<br/>","4":"<br/>","5":"Efek Flying Cloud Flag Formation akan hilang setelah durasinya berakhir atau lapisannya terkonsumsi dalam jumlah tertentu.<br/>","6":"Saat satu Normal Attack mengenai beberapa musuh secara bersamaan, jumlah lapisan Flying Cloud Flag Formation yang dikonsumsi akan disesuaikan dengan jumlah musuh yang terkena serangan. Efek dan jumlah lapisan Flying Cloud Flag Formation untuk setiap Karakter dalam party akan dihitung secara terpisah.<br/>","7":"<br/>","8":"<i>\"Di tengah suara genderang perang, tombak dan pedang saling berayun, sang wanita cantik berubah menjadi jenderal yang membawa panji perang.\"</i><br/>","9":"<i>\"Saat instrumen di atas panggung berbunyi serempak, lihatlah bagaimana dia mengalahkan para iblis ini!\"</i>"},"param":["DMG Skill","Peningkatan DMG","Durasi","Jumlah Lapisan","Cooldown","Konsumsi Energy","","","","","","","","","",""]},"4":{"name":"True to Oneself","field":{"0":"Menggunakan <strong>Opening Flourish</strong> tepat saat Yun Jin terkena serangan akan melancarkan bentuk Charge Tahap 2 (Mode Tahan)-nya."},"param":{}},"5":{"name":"Breaking Conventions","field":{"0":"Bonus DMG Normal Attack dari <strong>Flying Cloud Flag Formation</strong> akan meningkat lagi sebesar 2,5%/5%/7,5%/11,5% dari DEF Yun Jin saat party berisi Karakter dengan 1/2/3/4 jenis elemen berbeda."},"param":{}},"6":{"name":"Light Nourishment","field":{"0":"Saat masakan jenis petualangan dimasak dengan sempurna, terdapat 12% kemungkinan mendapatkan hasil 2 kali lipat."},"param":{}}},"constellation":{"0":{"0":"Mengurangi 18% CD <strong>Opening Flourish</strong>."},"1":{"0":"Setelah melancarkan <strong>Cliffbreaker's Banner</strong>, DMG Normal Attack seluruh anggota party di sekitar meningkat 15% selama 12 detik."},"2":{"0":"Meningkatkan 3 level <strong>Cliffbreaker's Banner</strong>.<br/>","1":"Maksimum: Lv. 15."},"3":{"0":"Setelah Yun Jin memicu reaksi Crystallize, DEF Yun Jin meningkat 20% selama 12 detik."},"4":{"0":"Meningkatkan 3 level <strong>Opening Flourish</strong>.<br/>","1":"Maksimum: Lv. 15."},"5":{"0":"Meningkatkan 12% Normal ATK SPD Karakter yang berada dalam status <strong>Flying Cloud Flag Formation</strong>."}}}