{"talent":{"0":{"name":"Oceanborne","field":{"0":{"0":"<strong>Normal Attack</strong><br/>","1":"Melancarkan hingga 5 serangan berturut-turut."},"1":{"0":"<strong>Charged Attack</strong><br/>","1":"Terus menguras Stamina untuk melancarkan tebasan berkelanjutan.<br/>","2":"Diakhiri dengan sebuah tebasan yang kuat."},"2":{"0":"<strong>Plunging Attack</strong><br/>","1":"Menerjang dari udara untuk menghantam tanah, menyerang semua musuh di jalurnya dan mengakibatkan DMG area saat mendarat."}},"param":["DMG Tahap 1","DMG Tahap 2","DMG Tahap 3","DMG Tahap 4","DMG Tahap 5","DMG Berputar Charged Attack","DMG Akhir Charged Attack","Konsumsi Stamina Charged Attack","Durasi Maksimum","DMG Selama Plunging","DMG Plunging Attack Min./Maks.","","","","",""]},"1":{"name":"Tidecaller","field":{"0":"Tidak ada yang perlu dikhawatirkan. Jika ada yang mengangkat tangan melawan dia atau anak buahnya, dia akan membalasnya sepuluh kali lipat dengan pedang dan petir.<br/>","1":"<br/>","2":"<strong>Tekan</strong><br/>","3":"Dengan akumulasi listrik, Beidou mengayunkan pedangnya dengan garang, mengakibatkan <electro>Electro DMG</electro>.<br/>","4":"<br/>","5":"<strong>Tahan</strong><br/>","6":"Mengangkat senjata dan menggunakannya sebagai perisai. Max DMG yang tertahan meningkat seiring dengan Max HP Beidou.<br/>","7":"Saat dilepas atau saat durasi skill selesai, menyerang dengan energi yang tersimpan di dalam pedang, mengakibatkan <electro>Electro DMG</electro>.<br/>","8":"DMG serangan meningkat berdasarkan jumlah serangan yang diterima selama skill berlangsung. Bonus DMG akan tercapai saat skill terpicu dua kali.<br/>","9":"Perisainya memiliki efek berikut:<br/>","10":["Memiliki 250% ketahanan terhadap <electro>Electro DMG</electro>.<br/>","Memberikan <electro>elemen Electro</electro> kepada Beidou saat skill diaktifkan.<br/>"],"11":"<br/>","12":"<i>Taklukkan deru lautan! Kendarai ombak dan terjanglah badai!</i>"},"param":["Pertahanan Perisai","Base DMG","Bonus DMG saat menerima DMG","Cooldown","","","","","","","","","","","",""]},"3":{"name":"Stormbreaker","field":{"0":"Dengan memanggil kembali semangat tarung saat di tengah pertarungan sengit melawan Haishan, Beidou memanggil petir dan kekuatan yang luar biasa untuk menciptakan Thunderbeast's Targe di sekelilingnya, mengakibatkan <electro>Electro DMG</electro> kepada musuh di sekitarnya.<br/>","1":"<br/>","2":"<strong>Thunderbeast's Targe</strong><br/>","3":["Saat Normal dan Charged Attack mengenai musuh, memanggil 1 sambaran petir yang dapat melompat di antara musuh, mengakibatkan <electro>Electro DMG</electro>.<br/>","Meningkatkan ketahanan Beidou terhadap interupsi, dan mengurangi DMG yang diterima.<br/>"],"4":"<br/>","5":"Sambaran petir terpicu maksimum 1 kali setiap detik.<br/>","6":"<br/>","7":"<i>Dengan gemuruh petir, Haishan pun ditaklukkan.</i>"},"param":["DMG Skill","DMG Lightning","Pengurangan DMG","Durasi","Cooldown","Konsumsi Energy","","","","","","","","","",""]},"4":{"name":"Retribution","field":{"0":"Membalas serangan menggunakan <strong>Tidecaller</strong> tepat saat serangan mengenai karakter akan memberikan Bonus DMG maksimum."},"param":{}},"5":{"name":"Lightning Storm","field":{"0":"Selama 10 detik setelah menggunakan skill <strong>Tidecaller</strong> dengan Bonus DMG maksimum, Beidou akan mendapatkan efek:<br/>","1":["Meningkatkan 15% DMG yang diakibatkan oleh Normal Attack dan Charged Attack. Meningkatkan 15% ATK SPD Normal Attack dan Charged Attack.<br/>","Mengurangi waktu persiapan Charged Attack secara pesat."]},"param":{}},"6":{"name":"Conqueror of Tides","field":{"0":"Mengurangi 20% konsumsi Stamina Karakter sendiri saat berenang.<br/>","1":"Efek tidak dapat ditumpuk dengan Talenta Pasif lain dengan efek yang sama."},"param":{}}},"constellation":{"0":{"0":"Saat <strong>Stormbreaker</strong> digunakan:<br/>","1":"Membentuk perisai yang menahan DMG sebesar 16% dari Max HP Beidou selama 15 detik.<br/>","2":"Perisai ini juga menahan <electro>Electro DMG</electro> 250% lebih efektif."},"1":{"0":"Sambaran listrik <strong>Stormbreaker</strong> menyambar 2 musuh lebih banyak."},"2":{"0":"Meningkatkan 3 level <strong>Tidecaller</strong>.<br/>","1":"Maksimum: Lv. 15."},"3":{"0":"Setelah terkena serangan, Normal Attack Beidou memperoleh 20% <electro>Electro DMG</electro> tambahan selama 10 detik."},"4":{"0":"Meningkatkan 3 level <strong>Stormbreaker</strong>.<br/>","1":"Maksimum: Lv. 15."},"5":{"0":"Selama durasi <strong>Stormbreaker</strong>, <electro>Electro RES</electro> musuh di sekitar berkurang 15%."}}}