{"talent":{"0":{"name":"Parthian Shot","field":{"0":{"0":"<strong>Normal Attack</strong><br/>","1":"Melancarkan hingga 4 tembakan panah berturut-turut menggunakan busur."},"1":{"0":"<strong>Charged Attack</strong><br/>","1":"Melancarkan sebuah <strong>Serangan Membidik</strong> yang lebih akurat untuk mengakibatkan DMG yang lebih besar.<br/>","2":"Saat membidik, angin kuat akan berkumpul di ujung anak panah. Panah dengan angin kuat yang terkumpul penuh akan mengakibatkan <anemo>Anemo DMG</anemo>."},"2":{"0":"<strong>Plunging Attack</strong><br/>","1":"Melancarkan hujan panah dari udara, menerjang tanah dengan kecepatan tinggi, menyerang musuh di jalur terjangan, dan mengakibatkan DMG Area saat mendarat."}},"param":["DMG Tahap 1","DMG Tahap 2","DMG Tahap 3","DMG Tahap 4","DMG Membidik","DMG Membidik Penuh","DMG Selama Plunging","DMG Plunging Attack Min./Maks.","","","","","","","",""]},"1":{"name":"Wind Realm of Nasamjnin","field":{"0":"Faruzan mengerahkan Polyhedron dan menyebabkan <anemo>Anemo DMG Area</anemo> terhadap musuh di sekitar dan mendapatkan efek Manifest Gale.<br/>","1":"Saat berada dalam status Manifest Gale, charge penuh Serangan Membidik Faruzan kali selanjutnya akan mengonsumsi efek Manifest Gale ini dan akan menjadi Hurricane Arrow dengan pusaran angin bertekanan tinggi, mengakibatkan <anemo>Anemo DMG</anemo> berdasarkan DMG Membidik Penuh Normal Attack: Parthian Shot.<br/>","2":"<br/>","3":"<strong>Pressurized Collapse</strong><br/>","4":"Hurricane Arrow akan menambahkan efek Pressurized Collapse terhadap musuh atau Karakter yang terkena. Efek ini akan hilang dalam waktu singkat, lalu menghasilkan pusaran angin yang mengakibatkan <anemo>Anemo DMG Area</anemo>, dan akan menarik objek atau musuh yang berada di sekitar; Jika belum mengenai musuh atau Karakter, maka akan menghasilkan efek Pressurized Collapse di posisi target yang terkena.<br/>","5":"DMG yang diakibatkan pusaran angin akan dianggap sebagai DMG Elemental Skill.<br/>","6":"<br/>","7":"<i>Angin kebenaran menerpa semangat orang-orang yang mencari kebenaran, dan menghancurkan seluruh racun prasangka.</i>"},"param":["DMG Skill","DMG Pusaran Angin Pressurized Collapse","Durasi Manifest Gale","Cooldown","","","","","","","","","","","",""]},"3":{"name":"The Wind's Secret Ways","field":{"0":"Faruzan mengerahkan \"Dazzling Polyhedron\" dengan cepat, melancarkan satu kali Whirlwind Pulse dan mengakibatkan <anemo>Anemo DMG Area</anemo>.<br/>","1":"Selama Dazzling Polyhedron aktif, akan terus-menerus bergerak dalam jalur berbentuk segitiga. Setiap kali menyentuh sudut segitiga, Dazzling Polyhedron akan melancarkan satu kali Whirlwind Pulse tambahan.<br/>","2":"<br/>","3":"<strong>Whirlwind Pulse</strong><br/>","4":["Saat Whirlwind Pulse dilancarkan, akan memberikan efek Perfidious Wind's Bale terhadap musuh di sekitar: Mengurangi <anemo>Anemo RES</anemo> musuh;<br/>","Saat melancarkan Whirlwind Pulse, akan memberikan efek Prayerful Wind's Benefit terhadap seluruh anggota party: Mendapatkan <anemo>Anemo DMG Bonus</anemo>.<br/>"],"5":"<br/>","6":"<i>Seseorang harus menghormati kebijaksanaan tak diketahui yang mungkin ditemukan tersembunyi di antara reruntuhan kuno.</i>"},"param":["DMG Skill","Anemo DMG Bonus","Durasi Prayerful Wind's Benefit","Pengurangan Anemo RES","Durasi Perfidious Wind's Bale","Durasi","Cooldown","Konsumsi Energy","","","","","","","",""]},"4":{"name":"Impetuous Flow","field":{"0":"Saat Faruzan berada dalam status Manifest Gale dari <strong>Wind Realm of Nasamjnin</strong>, waktu charge Serangan Membidik berkurang 60%; Akan bisa menambahkan efek Perfidious Wind's Bale dari <strong>The Wind's Secret Ways</strong> terhadap musuh yang terkena pusaran angin yang dihasilkan oleh Pressurized Collapse."},"param":{}},"5":{"name":"Lost Wisdom of the Seven Caverns","field":{"0":"Pada saat Normal Attack, Charged Attack, Plunging Attack, Elemental Skill atau Elemental Burst Karakter yang berada dalam status Prayerful Wind's Benefit dari <strong>The Wind's Secret Ways</strong> mengakibatkan <anemo>Anemo DMG</anemo> terhadap musuh, akan menghasilkan efek Hurricane Guard: DMG yang diakibatkan akan ditingkatkan berdasarkan 32% Base ATK Faruzan. Hurricane Guard bisa terpicu setiap 0,8 detik sekali. Efek ini akan hilang setelah durasi Prayerful Wind's setelah efeknya terpicu satu kali."},"param":{}},"6":{"name":"Tomes Light the Path","field":{"0":"Ketika dikirim untuk melakukan ekspedisi di Sumeru selama 20 jam, hadiah yang didapatkan akan bertambah 25%."},"param":{}}},"constellation":{"0":{"0":"Saat berada dalam satu kali efek Manifest Gale dari <strong>Wind Realm of Nasamjnin</strong>, Faruzan bisa melepaskan maksimum sebanyak 2 buah Hurricane Arrow dalam satu kali charge penuh Serangan Membidik."},"1":{"0":"Durasi Dazzling Polyhedron dari <strong>The Wind's Secret Ways</strong> meningkat 6 detik."},"2":{"0":"Meningkatkan 3 level <strong>Wind Realm of Nasamjnin</strong>. Maksimum: Lv. 15."},"3":{"0":"Pusaran angin dari <strong>Pressurized Collapse</strong> akan bisa mengembalikan Energy Faruzan berdasarkan jumlah musuh yang terkena: Saat mengenai satu musuh, akan bisa memulihkan 2 poin Energy untuk Faruzan; Untuk setiap penambahan satu musuh yang terkena, akan memulihkan 0,5 poin Energy untuk Faruzan.<br/>","1":"Dengan cara ini, satu kali pusaran angin bisa memulihkan Energy Faruzan sebanyak maksimum 4 poin Energy."},"4":{"0":"Meningkatkan 3 level <strong>The Wind's Secret Ways</strong>. Maksimum: Lv. 15."},"5":{"0":"CRIT DMG <strong>Anemo DMG</strong> yang diakibatkan Karakter yang berada dalam status Prayerful Wind's Benefit dari <anemo>The Wind's Secret Ways</anemo> meningkat 40%; Saat Karakter aktif yang berada dalam status Prayerful Wind's Benefit menerima DMG, akan memberikan Pressurized Collapse terhadap musuh ini. Efek ini bisa terpicu setiap 3 detik sekali, CD ini berlaku bagi seluruh anggota party."}}}