{"talent":{"0":{"name":"Whisper of Water","field":{"0":{"0":"<strong>Normal Attack</strong><br/>","1":"Melancarkan hingga 4 serangan air yang mengakibatkan <hydro>Hydro DMG</hydro>."},"1":{"0":"<strong>Charged Attack</strong><br/>","1":"Mengonsumsi sejumlah Stamina untuk mengakibatkan <hydro>Hydro DMG area</hydro> setelah jeda singkat."},"2":{"0":"<strong>Plunging Attack</strong><br/>","1":"Mengumpulkan kekuatan Hydro dan menerjang tanah, menyerang musuh di jalur terjangan dan mengakibatkan <hydro>Hydro DMG area</hydro> saat mendarat."}},"param":["DMG Tahap 1","DMG Tahap 2","DMG Tahap 3","DMG Tahap 4","DMG Charged Attack","Konsumsi Stamina Charged Attack","DMG Selama Plunging","DMG Plunging Attack Min./Maks.","","","","","","","",""]},"1":{"name":"Let the Show Begin♪","field":{"0":"Memanggil tetesan air yang menyerupai not balok yang membentuk sebuah Melody Loop, mengakibatkan <hydro>Hydro DMG</hydro> ke musuh di sekitar Karakter dan memberikan efek <hydro>Wet</hydro>.<br/>","1":"<br/>","2":"<strong>Melody Loop</strong><br/>","3":["Normal Attack Barbara dapat memulihkan HP seluruh anggota partymu dan karakter kawan di sekitar, jumlah HP yang dipulihkan berdasarkan pada Max HP Barbara;<br/>","Charged Attack Barbara memulihkan 4 kali lipat lebih banyak HP;<br/>","Memulihkan HP secara berkala untuk karakter sendiri yang sedang digunakan;<br/>","Memberikan efek <hydro>Wet</hydro> kepada karakter dan musuh yang menyentuhnya.<br/>"],"4":"<br/>","5":"<i>Musik Barbara adalah sihir yang dapat menyembuhkan teman-temannya.</i>"},"param":["Pemulihan HP/Hit","Regenerasi HP","DMG Tetesan Air","Durasi","Cooldown","","","","","","","","","","",""]},"3":{"name":"Shining Miracle♪","field":{"0":"Memulihkan HP karakter teman dan seluruh anggota party dalam jumlah besar, jumlah HP yang dipulihkan berdasarkan pada Max HP Barbara.<br/>","1":"<br/>","2":"<i>Keinginan Barbara untuk menyembuhkan adalah dorongan baginya untuk terus bertarung dan bernyanyi.</i>"},"param":["Pemulihan HP","Cooldown","Konsumsi Energy","","","","","","","","","","","","",""]},"4":{"name":"Glorious Season","field":{"0":"Mengurangi 12% konsumsi Stamina Karakter yang berada dalam Melody Loop dari skill <strong>Let the Show Begin♪</strong>."},"param":{}},"5":{"name":"Encore","field":{"0":"Setiap kali karakter yang sedang digunakan mengambil Elemental Orb/Particle, akan memperpanjang durasi Melody Loop dari skill <strong>Let the Show Begin♪</strong> selama 1 detik.<br/>","1":"Penambahan durasi maksimum adalah 5 detik."},"param":{}},"6":{"name":"With My Whole Heart ♪","field":{"0":"Saat masakan jenis pemulihan dimasak dengan sempurna, memiliki 12% kemungkinan mendapatkan hasil 2 kali lipat."},"param":{}}},"constellation":{"0":{"0":"Memulihkan 1 Energy Barbara setiap 10 detik."},"1":{"0":"Mengurangi 15% CD <strong>Let the Show Begin♪</strong>.<br/>","1":"Selama durasi skill, karakter saat ini akan mendapatkan 15% <hydro>Hydro DMG Bonus</hydro>."},"2":{"0":"Meningkatkan 3 level <strong>Shining Miracle♪</strong>.<br/>","1":"Maksimum: Lv. 15."},"3":{"0":"Setiap kali Barbara menyerang musuh dengan Charged Attack akan memulihkan 1 Energy.<br/>","1":"Maksimum 5 energy dapat dipulihkan dengan cara ini menggunakan salah satu Charged Attack."},"4":{"0":"Meningkatkan 3 level <strong>Let the Show Begin♪</strong>.<br/>","1":"Maksimum: Lv. 15."},"5":{"0":"Ketika Barbara berada di dalam party namun sedang tidak bertempur, dan salah seorang anggota party gugur:<br/>","1":"Secara otomatis akan menghidupkan kembali Karakter gugur tersebut;<br/>","2":["Dan memulihkan HP Karakter tersebut hingga 100%.<br/>"],"3":"Efek ini dapat terpicu setiap 15 menit."}}}