{"talent":{"0":{"name":"Wind Spirit Creation","field":{"0":{"0":"<strong>Normal Attack</strong><br/>","1":"Melancarkan hingga 4 serangan angin yang mengakibatkan <anemo>Anemo DMG</anemo>."},"1":{"0":"<strong>Charged Attack</strong><br/>","1":"Mengonsumsi sejumlah Stamina untuk mengakibatkan <anemo>Anemo DMG area</anemo> setelah jeda singkat."},"2":{"0":"<strong>Plunging Attack</strong><br/>","1":"Mengumpulkan kekuatan Anemo dan menerjang tanah, menyerang musuh di jalur terjangan dan mengakibatkan <anemo>Anemo DMG area</anemo> saat mendarat."}},"param":["DMG Tahap 1","DMG Tahap 2","DMG Tahap 3","DMG Tahap 4","DMG Charged Attack","Konsumsi Stamina Charged Attack","DMG Selama Plunging","DMG Plunging Attack Min./Maks.","","","","","","","",""]},"1":{"name":"Astable Anemohypostasis Creation - 6308","field":{"0":"Menciptakan Wind Spirit kecil yang menarik musuh dan obyek ke lokasi Wind Spirit sebelum menghempas musuh di area tersebut; juga mengakibatkan <anemo>Anemo DMG</anemo>.<br/>","1":"<br/>","2":"<i>Ini sedikit memalukan, tetapi meskipun elemen kehidupan yang dilahirkan melalui prosedur ini menghilang dengan sangat cepat, mereka cukup berguna saat bertualang. Bahkan percobaan yang gagal pun dapat memiliki penggunaan yang praktis.</i>"},"param":["DMG Skill","Cooldown","","","","","","","","","","","","","",""]},"3":{"name":"Forbidden Creation - Isomer 75 / Type II","field":{"0":"Sucrose melemparkan sebuah ramuan yang menciptakan Large Wind Spirit.<br/>","1":"Selama ramuan itu ada, Large Wind Spirit akan terus-menerus menarik musuh dan obyek yang ada di sekitar, menghasilkan <anemo>Anemo DMG</anemo>.<br/>","2":"<br/>","3":"<strong>Elemental Absorption</strong><br/>","4":"Ketika Wind Spirit bersentuhan dengan elemen<hydro>Hydro</hydro>/<pyro>Pyro</pyro>/<cryo>Cryo</cryo>/<electro>Electro</electro>, maka akan mengakibatkan elemental DMG tambahan dari tipe tersebut.<br/>","5":"Elemental Absorption hanya dapat muncul satu kali dalam sekali penggunaan.<br/>","6":"<br/>","7":"<i>Sucrose dulunya selalu memberikan nama kepada Anemo Hypostases miliknya. Namun mereka berkembang biak dengan cepat sampai melampaui Baron Bunny ke-893.</i>"},"param":["DMG Berkelanjutan","Tambahan Elemental DMG","Durasi","Cooldown","Konsumsi Energy","","","","","","","","","","",""]},"4":{"name":"Catalyst Conversion","field":{"0":"Ketika Sucrose memicu Swirl, akan meningkatkan Elemental Mastery anggota party dengan tipe elemen yang sama (tidak termasuk Sucrose sendiri) sebesar 50, berlangsung selama 8 detik."},"param":{}},"5":{"name":"Mollis Favonius","field":{"0":"Ketika skill <strong>Astable Anemohypostasis Creation - 6308</strong> atau <strong>Forbidden Creation - Isomer 75 / Type II</strong> mengenai musuh, akan meningkatkan Elemental Mastery seluruh anggota party (tidak termasuk Sucrose sendiri) sebanyak 20% dari Elemental Mastery Sucrose selama 8 detik."},"param":{}},"6":{"name":"Astable Invention","field":{"0":"Saat Sucrose membuat Material Penguatan Senjata dan Karakter, memiliki 10% kemungkinan untuk mendapatkan hasil 2 kali lipat."},"param":{}}},"constellation":{"0":{"0":"Meningkatkan 1 charge <strong>Astable Anemohypostasis Creation - 6308</strong>."},"1":{"0":"Durasi <strong>Forbidden Creation - Isomer 75 / Type II</strong> bertambah 2 detik."},"2":{"0":"Meningkatkan 3 level <strong>Astable Anemohypostasis Creation - 6308</strong>.<br/>","1":"Maksimum: Lv. 15."},"3":{"0":"Saat Normal Attack atau Charged Attack Sucrose mengenai musuh 7 kali, maka CD skill <strong>Astable Anemohypostasis Creation - 6308</strong> akan berkurang 1-7 detik secara acak.<br/>","1":"Serangan Sucrose dapat dihitung sebagai 1 kali setiap 0,1 detik."},"4":{"0":"Meningkatkan 3 level <strong>Forbidden Creation - Isomer 75 / Type II</strong>.<br/>","1":"Maksimum: Lv. 15."},"5":{"0":"Jika <strong>Forbidden Creation - Isomer 75 / Type II</strong> memicu Elemental Absorption, seluruh anggota party mendapatkan 20% Elemental DMG Bonus untuk elemen sesuai yang diserap selama durasinya."}}}