{"talent":{"0":{"name":"Sparkling Scatter","field":{"0":{"0":"<strong>Normal Attack</strong><br/>","1":"Menembakkan batu mutiara yang mengakibatkan <geo>Geo DMG</geo>.<br/>","2":"Saat mengenai musuh, Ningguang mendapatkan 1 Star Jade."},"1":{"0":"<strong>Charged Attack</strong><br/>","1":"Mengonsumsi sejumlah Stamina untuk menembakkan batu mutiara raksasa yang mengakibatkan <geo>Geo DMG</geo>.<br/>","2":"Jika Ningguang memiliki Star Jade, melancarkan Charged Attack juga akan menembakkan Star Jade ke musuh untuk mengakibatkan DMG tambahan."},"2":{"0":"<strong>Plunging Attack</strong><br/>","1":"Mengumpulkan kekuatan Geo dan menerjang tanah, menyerang musuh di jalur terjangan dan mengakibatkan <geo>Geo DMG area</geo> saat mendarat."}},"param":["DMG Normal Attack","DMG Charged Attack","DMG Per Star Jade","Konsumsi Stamina Charged Attack","DMG Selama Plunging","DMG Plunging Attack Min./Maks.","","","","","","","","","",""]},"1":{"name":"Jade Screen","field":{"0":"Ningguang membentuk sebuah perisai Geo yang terbuat dari emas, obsidian, dan kekayaannya untuk mengakibatkan <geo>Geo DMG area</geo>.<br/>","1":"<br/>","2":"<strong>Jade Screen</strong><br/>","3":["Menghalangi proyektil musuh.<br/>","HP Jade Screen mewarisi Max HP Ningguang berdasarkan persentase tertentu.<br/>"],"4":"<br/>","5":"Jade Screen dianggap sebagai sebuah <geo>Geo Construct</geo> dan dapat digunakan untuk menghalang beberapa jenis serangan, tapi tidak dapat dipanjat. Ningguang hanya dapat memiliki satu Jade Screen di satu waktu.<br/>","6":"<br/>","7":"<i>Kanvas bintang-bintang terukir di atas layar giok ini.</i>"},"param":["HP Terwariskan","DMG Skill","Cooldown","","","","","","","","","","","","",""]},"3":{"name":"Starshatter","field":{"0":"Ningguang mengumpulkan batu mutiara di sekeliling dirinya dan menyebarkan semuanya sekaligus untuk dilontarkan ke musuh, mengakibatkan <geo>Geo DMG</geo> yang besar.<br/>","1":"Jika Starshatter digunakan saat Jade Screen berada di dekatnya, Jade Screen juga akan menembakkan tambahan batu mutiara pada saat bersamaan.<br/>","2":"<br/>","3":"<i>Bintang-bintang terpecah, namun keheningan tidak terpecahkan.</i>"},"param":["DMG Per Gem","Cooldown","Konsumsi Energy","","","","","","","","","","","","",""]},"4":{"name":"Backup Plan","field":{"0":"Charged Attack Ningguang tidak mengonsumsi Stamina saat Ningguang memiliki Star Jade."},"param":{}},"5":{"name":"Strategic Reserve","field":{"0":"Karakter yang melewati <strong>Jade Screen</strong> akan mendapatkan 12% <geo>Geo DMG Bonus</geo> selama 10 detik."},"param":{}},"6":{"name":"Trove of Marvelous Treasures","field":{"0":"Memperlihatkan lokasi <strong>tambang ore untuk Forge</strong> di peta kecil."},"param":{}}},"constellation":{"0":{"0":"Saat Normal Attack mengenai musuh, mengakibatkan DMG Area."},"1":{"0":"Saat <strong>Jade Screen</strong> pecah, CD skill akan selesai.<br/>","1":"Dapat terpicu setiap 6 detik."},"2":{"0":"Meningkatkan 3 level <strong>Starshatter</strong>.<br/>","1":"Maksimum: Lv. 15."},"3":{"0":"<strong>Jade Screen</strong> meningkatkan Elemental RES karakter di sekitar sebanyak 10%."},"4":{"0":"Meningkatkan 3 level <strong>Jade Screen</strong>.<br/>","1":"Maksimum: Lv. 15."},"5":{"0":"Ningguang akan mendapatkan 7 Star Jade ketika <strong>Starshatter</strong> digunakan."}}}