{"talent":{"0":{"name":"Tempered Sword","field":{"0":{"0":"<strong>Normal Attack</strong><br/>","1":"Melancarkan hingga 4 serangan berturut-turut."},"1":{"0":"<strong>Charged Attack</strong><br/>","1":"Terus menguras Stamina untuk melancarkan tebasan berkelanjutan.<br/>","2":"Diakhiri dengan sebuah tebasan yang sangat kuat."},"2":{"0":"<strong>Plunging Attack</strong><br/>","1":"Menerjang dari udara untuk menghantam tanah, menyerang semua musuh di jalurnya dan mengakibatkan DMG Area saat mendarat."}},"param":["DMG Tahap 1","DMG Tahap 2","DMG Tahap 3","DMG Tahap 4","DMG Berputar Charged Attack","DMG Akhir Charged Attack","Konsumsi Stamina Charged Attack","Durasi Maksimum","DMG Selama Plunging","DMG Plunging Attack Min./Maks.","","","","","",""]},"1":{"name":"Searing Onslaught","field":{"0":"Melancarkan tebasan ke arah depan yang mengakibatkan <pyro>Pyro DMG</pyro>.<br/>","1":"<br/>","2":"Skill ini dapat digunakan 3 kali berturut-turut. Memasuki CD jika tidak digunakan lagi dalam waktu singkat.<br/>","3":"<br/>","4":"<i>Pedang ini mewakili nilai-nilai yang dijunjung Diluc: Keadilan, keberanian, dan kewajiban.</i>"},"param":["DMG Tahap 1","DMG Tahap 2","DMG Tahap 3","Cooldown","","","","","","","","","","","",""]},"3":{"name":"Dawn","field":{"0":"Mengerahkan kekuatan api yang meledak untuk menghempas musuh di sekitar, mengakibatkan <pyro>Pyro DMG</pyro>. Setelahnya, mengumpulkan elemen Pyro di ujung senjata dan memanggil seekor burung Phoenix yang terbang melaju, mengakibatkan <pyro>Pyro DMG</pyro> kepada semua musuh di jalurnya dan mengakibatkan <pyro>Pyro DMG Area</pyro> yang besar.<br/>","1":"Kobaran api yang tersisa pada pedang Diluc memberikan <pyro>Pyro Infusion</pyro> pada serangan Diluc.<br/>","2":"<br/>","3":"<i>Satu-satunya alasan untuk berjalan dalam kegelapan adalah untuk membuatnya terang. Lihatlah, cahaya yang lari di tengah kegelapan malam adalah pemberita fajar yang akan datang.</i>"},"param":["DMG Tebasan","DMG Berkelanjutan","DMG Ledakan","Cooldown","Durasi Infusion","Konsumsi Energy","","","","","","","","","",""]},"4":{"name":"Relentless","field":{"0":"Mengurangi 50% konsumsi Stamina Charged Attack Diluc, dan meningkatkan durasi maksimum selama 3 detik."},"param":{}},"5":{"name":"Blessing of Phoenix","field":{"0":"<pyro>Pyro Infusion</pyro> yang didapat dari skill <strong>Dawn</strong> bertahan 4 detik lebih lama. Diluc juga mendapatkan 20% <pyro>Pyro DMG Bonus</pyro> selama efek berlangsung."},"param":{}},"6":{"name":"Tradition of the Dawn Knight","field":{"0":"Mengembalikan 15% jumlah Ore yang digunakan saat membuat senjata tipe Claymore."},"param":{}}},"constellation":{"0":{"0":"Diluc menghasilkan 15% DMG lebih kepada musuh yang mempunyai HP di atas 50%."},"1":{"0":"Saat Diluc menerima DMG, meningkatkan 10% ATK dan 5% ATK SPD selama 10 detik.<br/>","1":"Efek ini dapat ditumpuk sampai 3 kali dan terpicu setiap 1,5 detik."},"2":{"0":"Meningkatkan 3 level <strong>Searing Onslaught</strong>.<br/>","1":"Maksimum: Lv. 15."},"3":{"0":"Mengerahkan <strong>Searing Onslaught</strong> secara beruntun akan meningkatkan DMG yang dihasilkan.<br/>","1":"2 detik setelah mengerahkan <strong>Searing Onslaught</strong>, DMG Searing Onslaught berikutnya meningkat 40% selama 2 detik."},"4":{"0":"Meningkatkan 3 level <strong>Dawn</strong>.<br/>","1":"Maksimum: Lv. 15."},"5":{"0":"Setelah mengerahkan <strong>Searing Onslaught</strong>, 2 Normal Attack dalam waktu 6 detik berikutnya akan meningkatkan 30% DMG dan ATK SPD.<br/>","1":"Selain itu, Searing Onslaught tidak akan mengganggu kombo Normal Attack."}}}