{"talent":{"0":{"name":"Kaboom!","field":{"0":{"0":"<strong>Normal Attack</strong><br/>","1":"Melempar benda yang akan meledak saat mengenai sesuatu! Melancarkan hingga 3 serangan ledakan yang mengakibatkan <pyro>Pyro DMG Area</pyro>."},"1":{"0":"<strong>Charged Attack</strong><br/>","1":"Mengonsumsi sejumlah Stamina dan mengakibatkan <pyro>Pyro DMG Area</pyro> kepada musuh setelah jeda singkat."},"2":{"0":"<strong>Plunging Attack</strong><br/>","1":"Mengumpulkan kekuatan Pyro dan menerjang tanah, menyerang musuh di jalur terjangan dan mengakibatkan <pyro>Pyro DMG Area</pyro> saat mendarat."}},"param":["DMG Tahap 1","DMG Tahap 2","DMG Tahap 3","DMG Charged Attack","Konsumsi Stamina Charged Attack","DMG Selama Plunging","DMG Plunging Attack Min./Maks.","","","","","","","","",""]},"1":{"name":"Jumpy Dumpty","field":{"0":"Melemparkan bom Jumpy Dumpty yang membawa kesenangan tidak terbatas!<br/>","1":"Saat dilempar, Jumpy Dumpty dapat memantul tiga kali, setiap pantulannya akan meledak dan mengakibatkan <pyro>Pyro DMG Area</pyro>.<br/>","2":"<br/>","3":"Pada pantulan ke-3, bomnya akan terbagi menjadi banyak ranjau.<br/>","4":"Ranjau-ranjau ini akan meledak saat menyentuh musuh, atau setelah jeda waktu yang singkat, kemudian mengakibatkan <pyro>Pyro DMG Area</pyro>.<br/>","5":"<br/>","6":"Dimulai dengan 2 kali jumlah penggunaan.<br/>","7":"<br/>","8":"<i>Jumpy Dumpty adalah teman baik Klee! Klee selalu tidak sabar untuk memperkenalkannya ke semua orang.</i>"},"param":["DMG Jumpy Dumpty","DMG Ranjau","Durasi Ranjau","Cooldown","","","","","","","","","","","",""]},"3":{"name":"Sparks 'n' Splash","field":{"0":"Kegembiraan Klee yang membara! Selama durasi skill, Sparks 'n' Splash yang muncul akan terus menyerang musuh-musuh di sekitar dan mengakibatkan <pyro>Pyro DMG Area</pyro>.<br/>","1":"<br/>","2":"<i>Para Knight meyakini kalau Klee pasti dilindungi sebuah bintang keberuntungan karena dia tidak pernah terluka karena bomnya sendiri ...</i>"},"param":["DMG Sparks 'n' Splash","Durasi","Cooldown","Konsumsi Energy","","","","","","","","","","","",""]},"4":{"name":"Pounding Surprise","field":{"0":"Saat <strong>Jumpy Dumpty</strong> atau Normal Attack Klee mengakibatkan DMG, Klee memiliki 50% kemungkinan untuk mendapatkan Explosive Spark.<br/>","1":"Explosive Spark akan terkonsumsi saat Klee melancarkan Charged Attack dan membuatnya tidak mengonsumsi Stamina serta mengakibatkan 50% DMG lebih besar."},"param":{}},"5":{"name":"Sparkling Burst","field":{"0":"Seluruh anggota party akan mendapatkan 2 Energy saat Charged Attack Klee mengakibatkan CRIT."},"param":{}},"6":{"name":"All Of My Treasures!","field":{"0":"Memperlihatkan lokasi <strong>produk khas Mondstadt</strong> di sekitar pada mini-map."},"param":{}}},"constellation":{"0":{"0":"Saat melancarkan serangan atau skill, Klee memiliki kemungkinan untuk menimbulkan percikan api yang mengakibatkan DMG sebesar 120% dari DMG <strong>Sparks 'n' Splash</strong> pada musuh."},"1":{"0":"DEF musuh berkurang 23% selama 10 detik saat terkena ranjau dari <strong>Jumpy Dumpty</strong>."},"2":{"0":"Meningkatkan 3 level <strong>Jumpy Dumpty</strong>.<br/>","1":"Maksimum: Lv. 15."},"3":{"0":"Jika Klee meninggalkan medan pertempuran saat <strong>Sparks 'n' Splash</strong> sedang berlangsung, kepergian Klee akan memicu ledakan yang mengakibatkan <pyro>Pyro DMG Area</pyro> sebesar 555% ATK."},"4":{"0":"Meningkatkan 3 level <strong>Sparks 'n' Splash</strong>.<br/>","1":"Maksimum: Lv. 15."},"5":{"0":"Saat <strong>Sparks 'n' Splash</strong> aktif, Klee akan memulihkan 3 Energy setiap 3 detik untuk semua anggota party (tidak termasuk Klee sendiri).<br/>","1":"Setelah melancarkan <strong>Sparks 'n' Splash</strong>, seluruh anggota party mendapatkan 10% <pyro>Pyro DMG Bonus</pyro> selama 25 detik."}}}