{"talent":{"0":{"name":"Whirlwind Thrust","field":{"0":{"0":"<strong>Normal Attack</strong><br/>","1":"Melancarkan hingga 6 serangan tombak berturut-turut."},"1":{"0":"<strong>Charged Attack</strong><br/>","1":"Mengonsumsi sejumlah Stamina untuk melakukan serangan ke arah atas."},"2":{"0":"<strong>Plunging Attack</strong><br/>","1":"Menerjang dari udara untuk menghantam tanah, menyerang musuh di jalur terjangan dan mengakibatkan DMG area saat mendarat.<br/>","2":"Saat melakukan Plunging Attack, Xiao tidak akan terkena DMG karena terjatuh dari ketinggian."}},"param":["DMG Tahap 1","DMG Tahap 2","DMG Tahap 3","DMG Tahap 4","DMG Tahap 5","DMG Tahap 6","DMG Charged Attack","Konsumsi Stamina Charged Attack","DMG Selama Plunging","DMG Plunging Attack Min./Maks.","","","","","",""]},"1":{"name":"Lemniscatic Wind Cycling","field":{"0":"Xiao menerjang ke depan dan mengakibatkan <anemo>Anemo DMG</anemo> pada musuh di jalurnya.<br/>","1":"Dapat digunakan di udara.<br/>","2":"Memiliki 2 kali penggunaan (charge) dari awal.<br/>","3":"<br/>","4":"<i>Menurut legenda dari dataran lain, dunia ini suatu hari akan dihancurkan oleh dua roda angin raksasa. Keahlian Xiao dalam menggunakan tombak tiada duanya, dan dapat menebas musuh seperti dua roda angin raksasa di legenda tersebut.</i>"},"param":["DMG Skill","Cooldown","","","","","","","","","","","","","",""]},"3":{"name":"Bane of All Evil","field":{"0":"Xiao mengenakan Yaksha Mask yang ditakuti oleh para iblis dan juga Archon pada ribuan tahun lalu.<br/>","1":"<br/>","2":"<strong>Yaksha Mask</strong><br/>","3":["Meningkatkan kekuatan melompat Xiao secara drastis.<br/>","Meningkatkan DMG dan area serangan.<br/>","Mengonversi DMG serangan menjadi <anemo>Anemo DMG</anemo> yang tidak dapat ditimpa oleh Elemental Infusion lainnya.<br/>"],"4":"<br/>","5":"Dalam status ini, Xiao akan terus kehilangan HP.<br/>","6":"Efek ini akan hilang saat Xiao keluar dari medan pertempuran.<br/>","7":"<br/>","8":"<i>Saat mengenakan topeng Yaksha-nya, Xiao berubah wujud menjadi Vigilant Yaksha — sang penakluk iblis yang ditakuti. Kekuatan yang sangat besar harus dibayar dengan rasa sakit yang sama besarnya. Dia juga disebut sebagai \"The Bane of All Evil.\"</i>"},"param":["Bonus DMG Normal/Charged/Plunging Attack","Pengurangan HP","Durasi","Cooldown","Konsumsi Energy","","","","","","","","","","",""]},"4":{"name":"Conqueror of Evil: Tamer of Demons","field":{"0":"Meningkatkan 5% DMG Xiao saat berada dalam status <strong>Bane of All Evil</strong>. Selama durasi skill, DMG Xiao akan terus meningkat sebesar 5% setiap 3 detik.<br/>","1":"Batas maksimum peningkatan DMG adalah 25%."},"param":{}},"5":{"name":"Dissolution Eon: Heaven Fall","field":{"0":"Menggunakan <strong>Lemniscatic Wind Cycling</strong> akan meningkatkan 15% DMG Lemniscatic Wind Cycling selanjutnya selama 7 detik.<br/>","1":"Efek dapat ditumpuk hingga 3 lapis. Durasi akan diperbarui setiap mendapat tumpukan baru."},"param":{}},"6":{"name":"Transcension: Gravity Defier","field":{"0":"Mengurangi 20% konsumsi Stamina saat memanjat untuk anggota party sendiri.<br/>","1":"Tidak dapat ditumpuk dengan Talenta Pasif dengan efek yang sama."},"param":{}}},"constellation":{"0":{"0":"Meningkatkan 1 charge <strong>Lemniscatic Wind Cycling</strong>."},"1":{"0":"Ketika Xiao berada di dalam party namun tidak sedang bertempur, Energy Recharge Xiao meningkat 25%."},"2":{"0":"Meningkatkan 3 level <strong>Lemniscatic Wind Cycling</strong>.<br/>","1":"Maksimum: Lv. 15."},"3":{"0":"Saat HP Xiao kurang dari 50%, DEF Xiao meningkat 100%."},"4":{"0":"Meningkatkan 3 level <strong>Bane of All Evil</strong>.<br/>","1":"Maksimum: Lv. 15."},"5":{"0":"Selama berada dalam status <strong>Bane of All Evil</strong>, Xiao akan mendapatkan 1 charge <strong>Lemniscatic Wind Cycling</strong> saat menyerang 2 musuh atau lebih dengan Plunging Attack. Selain itu, Xiao bisa menggunakan Lemniscatic Wind Cycling terus-menerus tanpa memedulikan waktu CD selama 1 detik berikutnya."}}}