{"talent":{"0":{"name":"Ceremonial Bladework","field":{"0":{"0":"<strong>Normal Attack</strong><br/>","1":"Melancarkan hingga 5 serangan berturut-turut."},"1":{"0":"<strong>Charged Attack</strong><br/>","1":"Mengonsumsi sejumlah Stamina untuk melancarkan dua tebasan pedang."},"2":{"0":"<strong>Plunging Attack</strong><br/>","1":"Menerjang dari udara untuk menghantam tanah, menyerang musuh di jalur terjangan dan mengakibatkan DMG area saat mendarat."}},"param":["DMG Tahap 1","DMG Tahap 2","DMG Tahap 3","DMG Tahap 4","DMG Tahap 5","DMG Charged Attack","Konsumsi Stamina Charged Attack","DMG Selama Plunging","DMG Plunging Attack Min./Maks.","","","","","","",""]},"1":{"name":"Frostgnaw","field":{"0":"Mengerahkan sebuah ledakan dingin yang mengakibatkan <cryo>Cryo DMG</cryo> ke musuh di depan Kaeya.<br/>","1":"<br/>","2":"<i>Kaeya tampaknya ramah, tapi sifatnya seperti es tak dapat dicairkan.</i>"},"param":["DMG Skill","Cooldown","","","","","","","","","","","","","",""]},"3":{"name":"Glacial Waltz","field":{"0":"Dengan menggabungkan es di udara, Kaeya membuat 3 pilar es di sekitar dia.<br/>","1":"Pilar-pilar ini akan mengikuti karakter dan mengakibatkan <cryo>Cryo DMG</cryo> ke musuh di jalurnya.<br/>","2":"<br/>","3":"<i>Senyum yang menawan, kata-kata ramah, dan embun beku tanpa ampun yang berada di balik itu semua... ini semua adalah senjata Kaeya.</i>"},"param":["DMG Skill","Cooldown","Durasi","Konsumsi Energy","","","","","","","","","","","",""]},"4":{"name":"Cold-Blooded Strike","field":{"0":"Setiap kali skill <strong>Frostgnaw</strong> mengenai satu musuh, memulihkan HP Kaeya sebesar 15% ATK."},"param":{}},"5":{"name":"Glacial Heart","field":{"0":"Musuh yang terkena efek <cryo>Frozen</cryo> dari skill <strong>Frostgnaw</strong> akan menjatuhkan Elemental Particle tambahan.<br/>","1":"Maksimum menjatuhkan 2 Elemental Particle tambahan setiap kalinya."},"param":{}},"6":{"name":"Hidden Strength","field":{"0":"Mengurangi 20% konsumsi Stamina Karakter sendiri saat berlari.<br/>","1":"Efek tidak dapat ditumpuk dengan Talenta Pasif lain yang memiliki efek yang sama."},"param":{}}},"constellation":{"0":{"0":"CRIT Rate dari Normal dan Charged Attack milik Kaeya terhadap musuh yang terkena efek <cryo>Cryo</cryo> meningkat sebesar 15%."},"1":{"0":"Setiap kali sebuah musuh dikalahkan dalam durasi <strong>Glacial Waltz</strong>, durasinya meningkat 2,5 detik, sampai maksimum 15 detik."},"2":{"0":"Meningkatkan 3 level <strong>Frostgnaw</strong>.<br/>","1":"Maksimum: Lv. 15."},"3":{"0":"Terpicu secara otomatis saat HP Kaeya kurang dari 20%:<br/>","1":"Membuat perisai yang menahan DMG setara dengan 30% Max HP Kaeya. Berlangsung selama 20 detik.<br/>","2":"Perisai ini menahan <cryo>Cryo DMG</cryo> dengan efisiensi 250%.<br/>","3":"Terpicu setiap 60 detik."},"4":{"0":"Meningkatkan 3 level <strong>Glacial Waltz</strong>.<br/>","1":"Maksimum: Lv. 15."},"5":{"0":"<strong>Glacial Waltz</strong> mengeluarkan 1 es tambahan, dan memulihkan 15 Energy saat skill digunakan."}}}