{"talent":{"0":{"name":"Favonius Bladework","field":{"0":{"0":"<strong>Normal Attack</strong><br/>","1":"Melancarkan hingga 5 serangan berturut-turut."},"1":{"0":"<strong>Charged Attack</strong><br/>","1":"Mengonsumsi sejumlah Stamina untuk melancarkan serangan yang menghempas musuh ke udara dengan kekuatan angin.<br/>","2":"Musuh yang terhempas akan terjatuh perlahan untuk sementara waktu."},"2":{"0":"<strong>Plunging Attack</strong><br/>","1":"Menerjang dari udara untuk menghantam tanah, menyerang musuh di jalur terjangan dan mengakibatkan DMG area saat mendarat."}},"param":["DMG Tahap 1","DMG Tahap 2","DMG Tahap 3","DMG Tahap 4","DMG Tahap 5","DMG Charged Attack","Konsumsi Stamina Charged Attack","DMG Selama Plunging","DMG Plunging Attack Min./Maks.","","","","","","",""]},"1":{"name":"Gale Blade","field":{"0":"Jean mengerahkan badai kecil dengan memusatkan kekuatan angin di bilah pedangnya untuk menghempas musuh ke arah yang dia tunjuk. Mengakibatkan <anemo>Anemo DMG</anemo> yang besar.<br/>","1":"<br/>","2":"<strong>Tahan</strong><br/>","3":"Dengan terus mengonsumsi Stamina, Jean dapat mengarahkan badai tersebut, yang menarik musuh dan obyek di sekitar ke depannya.<br/>","4":"Arahnya dapat disesuaikan.<br/>","5":"Karakter tidak dapat bergerak selama durasi skill.<br/>","6":"<br/>","7":"<i>Yang mengikuti Jean, pelindung berhati emas, adalah angin penjaga yang bisa menghalau bahaya dari rekan-rekannya.</i>"},"param":["DMG Skill","Konsumsi Stamina","Durasi Maksimum","Cooldown","","","","","","","","","","","",""]},"3":{"name":"Dandelion Breeze","field":{"0":"Dengan memanggil perlindungan dari angin, Jean dapat menciptakan Dandelion Field yang menghempas musuh di sekitar dan mengakibatkan <anemo>Anemo DMG</anemo>.<br/>","1":"Di saat yang sama, sejumlah besar HP untuk semua anggota party akan pulih secara langsung. Jumlah HP yang dipulihkan bergantung dari ATK Jean.<br/>","2":"<br/>","3":"<strong>Dandelion Field</strong><br/>","4":["Memulihkan HP karakter yang berada di dalam lingkup area secara berkelanjutan.<br/>","Memengaruhi musuh yang berada di dalam lingkup area dengan elemen <anemo>Anemo</anemo> secara berkelanjutan.<br/>","Mengakibatkan <anemo>Anemo DMG</anemo> kepada musuh yang memasuki atau keluar dari Dandelion Field.<br/>"],"5":"<br/>","6":"<i>Berkat Anemo bagaikan dandelion yang terbang ke seluruh pelosok dunia. Inilah fondasi prinsip dan pendirian Jean.</i>"},"param":["DMG Burst","DMG Keluar Masuk Field","Pemulihan Field","Regenerasi HP/dtk","Cooldown","Konsumsi Energy","","","","","","","","","",""]},"4":{"name":"Wind Companion","field":{"0":"Saat Normal Attack Jean mengenai musuh, memiliki 50% kemungkinan untuk memulihkan HP seluruh anggota party sebesar 15% ATK Jean."},"param":{}},"5":{"name":"Let the Wind Lead","field":{"0":"Menggunakan <strong>Dandelion Breeze</strong> akan memulihkan 20% Energy."},"param":{}},"6":{"name":"Guiding Breeze","field":{"0":"Saat masakan jenis pemulihan dimasak dengan sempurna, memiliki 12% kemungkinan mendapatkan hasil 2 kali lipat."},"param":{}}},"constellation":{"0":{"0":"Meningkatkan kecepatan menarik <strong>Gale Blade</strong> setelah ditahan lebih dari 1 detik, dan meningkatkan 40% DMG yang diakibatkan."},"1":{"0":"Meningkatkan 15% Movement SPD dan ATK SPD seluruh anggota party selama 15 detik saat Jean mengambil Elemental Orb atau Particle."},"2":{"0":"Meningkatkan 3 level <strong>Dandelion Breeze</strong>.<br/>","1":"Maksimum: Lv. 15."},"3":{"0":"Mengurangi 40% <anemo>Anemo RES</anemo> musuh yang berada di dalam lingkup area <strong>Dandelion Breeze</strong>."},"4":{"0":"Meningkatkan 3 level <strong>Gale Blade</strong>.<br/>","1":"Maksimum: Lv. 15."},"5":{"0":"Mengurangi 35% DMG yang diterima saat berada di dalam <strong>Dandelion Breeze</strong>. Efek ini masih bertahan selama 3 serangan atau 10 detik setelah meninggalkan lingkup area skill."}}}