{"talent":{"0":{"name":"Kätzlein Style","field":{"0":{"0":"<strong>Normal Attack</strong><br/>","1":"Melancarkan hingga 5 serangan berturut-turut menggunakan busur."},"1":{"0":"<strong>Charged Attack</strong><br/>","1":"Mengerahkan sebuah <strong>Serangan Membidik</strong> yang lebih akurat untuk mengakibatkan DMG lebih besar.<br/>","2":"Saat membidik, es akan berkumpul di ujung anak panah. Panah dengan es yang terkumpul penuh akan mengakibatkan <cryo>Cryo DMG</cryo>."},"2":{"0":"<strong>Plunging Attack</strong><br/>","1":"Melancarkan hujan panah dari udara dan menerjang tanah dengan kecepatan tinggi, mengakibatkan DMG area saat mendarat."}},"param":["DMG Tahap 1","DMG Tahap 2","DMG Tahap 3","DMG Tahap 4","DMG Tahap 5","DMG Membidik","DMG Membidik Penuh","DMG Selama Plunging","DMG Plunging Attack Min./Maks.","","","","","","",""]},"1":{"name":"Icy Paws","field":{"0":"Menembakkan Icy Paws yang mengakibatkan <cryo>Cryo DMG</cryo> dan membentuk perisai saat Icy Paws mengenai musuh.<br/>","1":"Jumlah DMG yang dapat ditahan perisai ditentukan berdasarkan Max HP Diona, dan durasinya ditentukan berdasarkan jumlah musuh yang terkena Icy Paws.<br/>","2":"<br/>","3":"<strong>Tekan</strong><br/>","4":"Menembakkan 2 Icy Paws dengan cepat<br/>","5":"<br/>","6":"<strong>Tahan</strong><br/>","7":"Bergerak mundur dengan cepat, kemudian menembakkan 5 Icy Paws.<br/>","8":"Perisai yang terbentuk setelah tombol skill ditahan, akan memperoleh bonus 75% penyerapan DMG.<br/>","9":"<br/>","10":"Perisai ini memiliki bonus 250% penyerapan <cryo>Cryo DMG</cryo>. Saat perisai terbentuk, karakter yang sedang digunakan akan terpengaruh <cryo>Cryo</cryo> dalam waktu singkat.<br/>","11":"<br/>","12":"<i>Saat Diona baru menjadi bartender, sebanyak apa pun es yang dimasukkannya ke dalam koktail, tidak pernah ada seorang pun pemabuk yang terluka karena dingin. Tetapi setelah Diona mendapatkan Vision — kini dia bisa membuat minuman sangat dingin yang membuat para pemabuk kedinginan hingga sakit kepala. Hebat!</i>"},"param":["DMG Per Ice Paw","Ketahanan Dasar Perisai","Durasi Per Claw","Cooldown (Mode Tekan)","Cooldown (Mode Tahan)","","","","","","","","","","",""]},"3":{"name":"Signature Mix","field":{"0":"Melemparkan minuman dingin spesial yang mengakibatkan <cryo>Cryo DMG area</cryo> dan menciptakan Drunken Mist dalam area tersebut.<br/>","1":"<br/>","2":"<strong>Drunken Mist</strong><br/>","3":["Mengakibatkan <cryo>Cryo DMG</cryo> berkelanjutan terhadap semua musuh yang berada di dalam area.<br/>","Memulihkan HP karakter yang berada di dalam lingkup area secara terus-menerus.<br/>"],"4":"<br/>","5":"<i> Racikan mengerikan yang bahkan dianggap tidak manusiawi oleh Diona. Rasa mengerikan yang muncul di awal kecapan harus disuguhkan kepada musuh. Sedangkan rasa dingin dan aroma manis yang muncul setelahnya... sayang sekali, hanya bisa dinikmati dengan hidung dan permukaan kulit saja.</i>"},"param":["DMG Skill","DMG Berkelanjutan di Area","Regenerasi HP","Durasi","Cooldown","Konsumsi Energy","","","","","","","","","",""]},"4":{"name":"Cat's Tail Secret Menu","field":{"0":"Meningkatkan 10% Movement SPD dan mengurangi 10% konsumsi Stamina untuk Karakter yang dilindungi oleh perisai dari skill <strong>Icy Paws</strong>."},"param":{}},"5":{"name":"Drunkards' Farce","field":{"0":"Mengurangi 10% ATK musuh yang masuk ke area skill <strong>Signature Mix</strong> selama 15 detik."},"param":{}},"6":{"name":"Complimentary Bar Food","field":{"0":"Saat masakan jenis pemulihan dimasak dengan sempurna, memiliki 12% kemungkinan mendapatkan hasil 2 kali lipat."},"param":{}}},"constellation":{"0":{"0":"Memulihkan 15 Energy Diona setelah efek <strong>Signature Mix</strong> berakhir."},"1":{"0":"Meningkatkan 15% DMG <strong>Icy Paws</strong>, dan meningkatkan 15% kemampuan menahan DMG;<br/>","1":"Selain itu, ketika skill ini mengenai musuh, akan menciptakan sebuah perisai untuk karakter lain di sekitarnya yang dapat menahan hingga 50% dari penahanan DMG perisai <strong>Icy Paws</strong> selama 5 detik."},"2":{"0":"Meningkatkan 3 level <strong>Signature Mix</strong>.<br/>","1":"Maksimum: Lv. 15."},"3":{"0":"Dalam area <strong>Signature Mix</strong>, waktu bagi Diona untuk melakukan Serangan Membidik berkurang 60%."},"4":{"0":"Meningkatkan 3 level <strong>Icy Paws</strong>.<br/>","1":"Maksimum: Lv. 15."},"5":{"0":"Karakter dalam area <strong>Signature Mix</strong> akan mendapatkan efek berikut berdasarkan jumlah HP mereka:<br/>","1":["Meningkatkan 30% Bonus Pemulihan HP saat HP sama dengan atau kurang dari 50%.<br/>","Elemental Mastery +200 ketika HP di atas 50%."]}}}