{"talent":{"0":{"name":"Steel Fang","field":{"0":{"0":"<strong>Normal Attack</strong> Melancarkan hingga 4 tebasan berturut-turut."},"1":{"0":"<strong>Charged Attack</strong><br/>","1":"Terus menguras Stamina untuk melancarkan serangan berputar yang mengakibatkan DMG ke musuh di sekitar.<br/>","2":"Diakhiri dengan sebuah tebasan yang kuat."},"2":{"0":"<strong>Plunging Attack</strong><br/>","1":"Menerjang dari udara untuk menghantam tanah, menyerang musuh di jalur terjangan dan mengakibatkan DMG area saat mendarat."}},"param":["DMG Tahap 1","DMG Tahap 2","DMG Tahap 3","DMG Tahap 4","DMG Berputar Charged Attack","DMG Akhir Charged Attack","Konsumsi Stamina Charged Attack","Durasi Maksimum","DMG Selama Plunging","DMG Plunging Attack Min./Maks.","","","","","",""]},"1":{"name":"Claw and Thunder","field":{"0":"Memburu mangsanya dengan teknik yang diajarkan oleh keluarganya dan Lupical.<br/>","1":"<br/>","2":"<strong>Tekan</strong><br/>","3":"Mengayunkan Thunder Wolf Claw, mengakibatkan <electro>Electro DMG</electro> ke musuh di depan Razor.<br/>","4":"Saat mengenai musuh, Razor akan mendapatkan Electro Sigil yang meningkatkan kecepatan Energy Recharge.<br/>","5":"Razor dapat memiliki paling banyak 3 Electro Sigil dalam waktu bersamaan, dan mendapatkan Electro Sigil baru akan memutar ulang durasi mereka.<br/>","6":"<br/>","7":"<strong>Tahan</strong><br/>","8":"Mengumpulkan Electro Energy untuk mengerahkan badai petir dalam area kecil, mengakibatkan <electro>Electro DMG</electro> yang besar dan mengonsumsi seluruh Electro Sigil milik Razor.<br/>","9":"Setiap Electro Sigil yang digunakan dengan cara ini akan dikonversi menjadi Energy untuk Razor.<br/>","10":"<br/>","11":"<i>Pada saat petir menyambar, kamu dapat melihat mata Razor yang sedang mengamati mangsanya.</i>"},"param":["DMG One-tap","DMG Menahan","Peningkatan Energy Recharge per Sigil","Pemulihan Energy per Electro Sigil","Durasi Electro Sigil","Cooldown (Mode Tekan)","Cooldown (Mode Tahan)","","","","","","","","",""]},"3":{"name":"Lightning Fang","field":{"0":"Memanggil Wolf Within untuk mengakibatkan <electro>Electro DMG</electro> ke semua musuh di sekitar. Juga akan menghilangkan semua Electro Sigil milik Razor, yang akan dikonversi menjadi Energy untuknya.<br/>","1":"Wolf Within akan bertempur bersama Razor selama durasi skill.<br/>","2":"<br/>","3":"<strong>The Wolf Within</strong><br/>","4":["Menyerang bersama dengan Normal Attack Razor dan mengakibatkan <electro>Electro DMG</electro>;<br/>","Meningkatkan ATK SPD dan <electro>Electro RES</electro> Razor;<br/>","Membuat Razor kebal terhadap DMG yang diakibatkan oleh efek <electro>Electro-Charged</electro>;<br/>","Menonaktifkan Charged Attack milik Razor.<br/>"],"5":"<br/>","6":"Efek-efek ini berakhir saat Razor meninggalkan medan pertempuran.<br/>","7":"Saat Razor meninggalkan medan pertempuran, hingga 10 Energy akan dikembalikan kepadanya berdasarkan durasi yang tersisa dari skill ini.<br/>","8":"<br/>","9":"<i>Sang serigala telah terbangun, perburuan dimulai.</i>"},"param":["DMG Burst","DMG Spirit","Peningkatan Normal Attack SPD","Bonus Electro RES","Durasi","Cooldown","Konsumsi Energy","","","","","","","","",""]},"4":{"name":"Awakening","field":{"0":"Mengurangi 18% CD <strong>Claw and Thunder</strong>.<br/>","1":"Melancarkan <strong>Lightning Fang</strong> akan menyelesaikan CD <strong>Claw and Thunder</strong>."},"param":{}},"5":{"name":"Hunger","field":{"0":"Meningkatkan 30% Energy Recharge saat Energy Razor kurang dari 50%."},"param":{}},"6":{"name":"Wolvensprint","field":{"0":"Mengurangi 20% konsumsi Stamina Karakter sendiri saat berlari.<br/>","1":"Efek tidak dapat ditumpuk dengan Talenta Pasif lain yang memiliki efek yang sama."},"param":{}}},"constellation":{"0":{"0":"Saat mengambil Elemental Orb atau Particle, meningkatkan 10% DMG Razor selama 8 detik."},"1":{"0":"Meningkatkan 10% CRIT Rate Razor terhadap musuh dengan HP kurang dari 30%."},"2":{"0":"Meningkatkan 3 level <strong>Lightning Fang</strong>.<br/>","1":"Maksimum: Lv. 15."},"3":{"0":"Saat <strong>Claw and Thunder</strong> ditekan, DEF musuh yang terkena akan berkurang 15% selama 7 detik."},"4":{"0":"Meningkatkan 3 level <strong>Claw and Thunder</strong>.<br/>","1":"Maksimum: Lv. 15."},"5":{"0":"Setiap 10 detik, pedang Razor mengumpulkan kekuatan secara otomatis, membuat Normal Attack berikutnya melepaskan serangan listrik, mengakibatkan 100% dari ATK Razor sebagai <electro>Electro DMG</electro>.<br/>","1":"Saat Razor tidak menggunakan <strong>Lightning Fang</strong>, sambaran petir pada musuh akan memberikan Razor sebuah Electro Sigil untuk <strong>Claw and Thunder</strong>."}}}