{"talent":{"0":{"name":"Seal of Approval","field":{"0":{"0":"<strong>Normal Attack</strong><br/>","1":"Melancarkan hingga 3 serangan bola api yang mengakibatkan <pyro>Pyro DMG</pyro>.<br/>","2":"Ketika Normal Attack Yanfei mengenai musuh, Yanfei akan mendapatkan 1 Scarlet Seal. Scarlet Seal maksimum yang bisa dikumpulkan Yanfei adalah 3 buah. Setiap kali efek ini terpicu, durasi dari Scarlet Seal yang telah terkumpul akan diperbarui.<br/>","3":"Setiap Scarlet Seal akan mengurangi konsumsi Stamina Yanfei dan akan menghilang jika Yanfei meninggalkan medan pertempuran."},"1":{"0":"<strong>Charged Attack</strong><br/>","1":"Mengonsumsi Stamina dan semua Scarlet Seal untuk mengakibatkan <pyro>Pyro DMG area</pyro> setelah jeda singkat.<br/>","2":"Area dan DMG dari Charged Attack ini akan meluas dan meningkat sesuai dengan jumlah Scarlet Seal yang dikonsumsi."},"2":{"0":"<strong>Plunging Attack</strong><br/>","1":"Mengumpulkan kekuatan Pyro dan menerjang tanah, menyerang musuh di jalur terjangan dan mengakibatkan <pyro>Pyro DMG area</pyro> saat mendarat."}},"param":["DMG Tahap 1","DMG Tahap 2","DMG Tahap 3","DMG Charged Attack","Konsumsi Stamina Charged Attack","Pengurangan Konsumsi Stamina Scarlet Seal","Durasi Scarlet Seal","DMG Selama Plunging","DMG Plunging Attack Ketinggian Rendah/Tinggi","","","","","","",""]},"1":{"name":"Signed Edict","field":{"0":"Memanggil api yang mengakibatkan <pyro>Pyro DMG Area</pyro>.<br/>","1":"Yanfei akan mendapatkan Scarlet Seal dalam jumlah maksimum saat Signed Edict mengenai musuh.<br/>","2":"<br/>","3":"<i>Selain dari penggunaan legalnya, segel Yanfei juga dilengkapi dengan syarat dan ketentuan tambahan yang disesuaikan. Bagaimanapun juga, Bagian Urusan Sipil tidak bisa mengubah hukum alam.</i>"},"param":["DMG Skill","Cooldown","","","","","","","","","","","","","",""]},"3":{"name":"Done Deal","field":{"0":"Memicu semburan api dahsyat yang menyerbu musuh di sekitar dan mengakibatkan <pyro>Pyro DMG Area</pyro>, serta memberikan Scarlet Seal dalam jumlah maksimum dan efek Brilliance pada Yanfei.<br/>","1":"<br/>","2":"<strong>Brilliance</strong><br/>","3":"Memiliki efek berikut:<br/>","4":["Memberikan Scarlet Seal pada Yanfei setiap beberapa saat.<br/>","Meningkatkan DMG yang diakibatkan oleh Charged Attack.<br/>","Efek Brilliance akan berakhir saat Yanfei meninggalkan medan pertempuran atau gugur.<br/>"],"5":"<br/>","6":"<i>\"Inilah daftar istilah lengkap untuk urusan hidup dan mati — maksudku adalah hidupku dan kematianmu!\"</i>"},"param":["DMG Skill","","Jeda Pemberian Scarlet Seal","Peningkatan DMG Charged Attack","Durasi","Cooldown","Konsumsi Energy","","","","","","","","",""]},"4":{"name":"Proviso","field":{"0":"Saat Yanfei mengonsumsi Scarlet Seal dengan menggunakan Charged Attack, setiap Scarlet Seal akan meningkatkan 5% <pyro>Bonus Pyro DMG</pyro> Yanfei selama 6 detik. Jika Yanfei menggunakan Charged Attack sekali lagi selama durasi masih berlangsung, maka efek sebelumnya akan hilang."},"param":{}},"5":{"name":"Blazing Eye","field":{"0":"Saat Charged Attack Yanfei mengakibatkan CRIT pada musuh, Yanfei akan mengakibatkan <pyro>Pyro DMG Area</pyro> tambahan sebesar 80% ATK Yanfei. DMG ini terhitung sebagai DMG Charged Attack."},"param":{}},"6":{"name":"Encyclopedic Expertise","field":{"0":"Memperlihatkan lokasi <strong>produk khas Liyue</strong> di sekitar pada mini-map."},"param":{}}},"constellation":{"0":{"0":"Saat Yanfei menggunakan Charged Attack, setiap Scarlet Seal yang terkumpul akan mengurangi 10% konsumsi stamina Charged Attack dan meningkatkan ketahanan terhadap interupsi selama Charged Attack berlangsung."},"1":{"0":"Meningkatkan 20% CRIT Rate Charged Attack Yanfei terhadap musuh dengan HP kurang dari 50%."},"2":{"0":"Meningkatkan 3 level <strong>Signed Edict</strong>.<br/>","1":"Maksimum: Lv. 15."},"3":{"0":"Saat <strong>Done Deal</strong> digunakan:<br/>","1":"Menciptakan perisai yang dapat menahan DMG hingga 45% dari Max HP Yanfei selama 15 detik.<br/>","2":"Perisai ini dapat menahan <pyro>Pyro DMG</pyro> 250% lebih efektif."},"4":{"0":"Meningkatkan 3 level <strong>Done Deal</strong>.<br/>","1":"Maksimum: Lv. 15."},"5":{"0":"Meningkatkan jumlah maksimum Scarlet Seal sebanyak 1."}}}