{"talent":{"0":{"name":"Shinobu's Shadowsword","field":{"0":{"0":"<strong>Normal Attack</strong><br/>","1":"Melancarkan hingga 4 serangan berturut-turut."},"1":{"0":"<strong>Charged Attack</strong><br/>","1":"Mengonsumsi sejumlah Stamina untuk melancarkan dua tebasan pedang."},"2":{"0":"<strong>Plunging Attack</strong><br/>","1":"Menerjang dari udara untuk menghantam tanah, menyerang musuh di jalur terjangan dan mengakibatkan DMG area saat mendarat."}},"param":["DMG Tahap 1","DMG Tahap 2","DMG Tahap 3","DMG Tahap 4","DMG Charged Attack","Konsumsi Stamina Charged Attack","DMG Selama Plunging","DMG Plunging Attack Min./Maks.","","","","","","","",""]},"1":{"name":"Sanctifying Ring","field":{"0":"Menciptakan Grass Ring of Sanctification dengan mengorbankan sebagian dari HP-nya, mengakibatkan <electro>Electro DMG</electro> kepada musuh di sekitarnya.<br/>","1":"<br/>","2":"<strong>Grass Ring of Sanctification</strong><br/>","3":"Mengikuti Karakter aktif. Mengakibatkan <electro>Electro DMG</electro> kepada musuh di sekitar setiap 1,5 detik dan memulihkan HP Karakter aktif di dalam Area efeknya berdasarkan Max HP Kuki Shinobu.<br/>","4":"<br/>","5":"HP yang terkonsumsi akibat penggunaan skill ini akan mengurangi HP Shinobu sampai batas 20% maksimum.<br/>","6":"<br/>","7":"<i>Ikat Naku Weed secara melingkar di pinggangmu, dan itu bisa membantumu mengusir roh jahat.</i>"},"param":["DMG Skill","Pemulihan Grass Ring of Sanctification","DMG Grass Ring of Sanctification","Mengonsumsi","Durasi","Cooldown","","","","","","","","","",""]},"3":{"name":"Gyoei Narukami Kariyama Rite","field":{"0":"Menancapkan pedang pengusir roh jahat di tanah, dan membuat sebuah medan yang membersihkan area yang kotor, mengakibatkan <electro>Electro DMG</electro> secara berkelanjutan kepada musuh di dalam Area efeknya berdasarkan Max HP Kuki Shinobu.<br/>","1":"Jika HP Shinobu 50% atau kurang saat skill ini digunakan, durasi medan ini akan lebih lama.<br/>","2":"<br/>","3":"<i>Sebenarnya ini teknik yang digunakan saat menyiangi rumput dan ritual doa saat panen, dan walaupun hari-harinya sebagai miko telah berakhir tapi Shinobu tidak pernah lupa dengan teknik ini.</i>"},"param":["DMG Instan Tunggal","Total DMG","Durasi","Cooldown","Konsumsi Energy","","","","","","","","","","",""]},"4":{"name":"Breaking Free","field":{"0":"Saat HP Shinobu tidak lebih dari 50%, maka bonus pemulihannya meningkat 15%."},"param":{}},"5":{"name":"Heart's Repose","field":{"0":"Kemampuan <strong>Sanctifying Ring</strong> akan menguat berdasarkan Elemental Mastery milik Kuki Shinobu:<br/>","1":["Jumlah pemulihan akan meningkat sebesar 75% dari Elemental Mastery;<br/>","DMG yang diakibatkan akan meningkat sebesar 25% dari Elemental Mastery."]},"param":{}},"6":{"name":"Protracted Prayers","field":{"0":"Ketika dikirim untuk melakukan ekspedisi di Inazuma selama 20 jam, hadiah yang didapatkan akan bertambah 25%."},"param":{}}},"constellation":{"0":{"0":"Meningkatkan 50% area serangan <strong>Gyoei Narukami Kariyama Rite</strong>."},"1":{"0":"Meningkatkan 3 detik durasi <strong>Grass Ring of Santification</strong>"},"2":{"0":"Meningkatkan 3 level <strong>Sanctifying Ring</strong>.<br/>","1":"Maksimum: Lv. 15."},"3":{"0":"Saat Normal, Charged, atau Plunging Attack dari Karakter yang terpengaruh oleh <strong>Grass Ring of Sanctification</strong> milik Shinobu memukul musuh, maka Thundergrass Mark akan muncul di posisi musuh dan mengakibatkan <electro>Electro DMG Area</electro> berdasarkan 9,7% Max HP Shinobu.<br/>","1":"Efek ini dapat terpicu setiap 5 detik."},"4":{"0":"Meningkatkan 3 level <strong>Gyoei Narukami Kariyama Rite</strong>.<br/>","1":"Maksimum: Lv. 15."},"5":{"0":"Saat Kuki Shinobu menerima DMG mematikan, DMG tersebut tidak akan membuatnya gugur. Efek ini terpicu secara otomatis saat HP-nya mencapai 1 dan dapat terpicu setiap 60 detik.<br/>","1":"Saat HP Shinobu turun sampai di bawah 25%, Shinobu akan mendapatkan 150 Elemental Mastery selama 15 detik. Efek ini terpicu setiap 60 detik."}}}