{"talent":{"0":{"name":"Kamisato Art: Kabuki","field":{"0":{"0":"<strong>Normal Attack</strong><br/>","1":"Melancarkan maks. 5 tebasan pedang."},"1":{"0":"<strong>Charged Attack</strong><br/>","1":"Mengonsumsi sejumlah Stamina untuk terus mengerahkan rentetan tebasan."},"2":{"0":"<strong>Plunging Attack</strong><br/>","1":"Menukik dari langit dan menghantam tanah, menyerang musuh di jalurnya dan mengakibatkan DMG Area saat mendarat."}},"param":["DMG Tahap 1","DMG Tahap 2","DMG Tahap 3","DMG Tahap 4","DMG Tahap 5","DMG Charged Attack","Konsumsi Stamina Charged Attack","DMG Selama Plunging","DMG Plunging Attack Rendah/Tinggi","","","","","","",""]},"1":{"name":"Kamisato Art: Hyouka","field":{"0":"Memanggil dan menerbangkan bunga es ke arah musuh di sekitar untuk mengakibatkan <cryo>Cryo DMG Area</cryo>.<br/>","1":"<br/>","2":"<i>\"Awan menyelimuti langit malam yang cerah diterangi rembulan. Rasa rindu yang timbul layaknya kabut, memenuhi hati seseorang dengan keinginan tuk' mengembara.\"</i>"},"param":["DMG Skill","Cooldown","","","","","","","","","","","","","",""]},"2":{"name":"Kamisato Art: Senho","field":{"0":"<strong>Alternate Sprint</strong><br/>","1":"Ayaka mengonsumsi energi untuk bersembunyi di balik es dan salju yang mengikuti gerakannya.<br/>","2":"<br/>","3":"Dalam status Senho, Ayaka akan bergerak dengan kecepatan tinggi di atas permukaan air.<br/>","4":"Saat Ayaka muncul kembali, efek berikut akan berlaku:<br/>","5":["Melepaskan energi dingin yang menambahkan efek <cryo>Cryo</cryo> kepada musuh di sekitar.<br/>","Energi dingin berkumpul di bilah pedang dan dalam waktu singkat membuat serangan Ayaka memperoleh infusi <cryo>Cryo</cryo>.<br/>"],"6":"<br/>","7":"<i>\"Bulu-bulu basah yang indah menghilang dalam sekejap, sang bangau putih pun menapaki air tanpa cela.\"</i>"},"param":{}},"4":{"name":"Kamisato Art: Soumetsu","field":{"0":"Memanggil es dengan ketenangan tanpa cela, lalu melepaskan Frostflake Seki no To yang terus bergerak maju.<br/>","1":"<br/>","2":"<strong>Frostflake Seki no To</strong><br/>","3":["Terus-menerus menebas musuh yang disentuhnya dengan angin dingin setajam pisau dan mengakibatkan <cryo>Cryo DMG</cryo>;<br/>","Terbuka mekar setelah durasinya berakhir dan mengakibatkan <cryo>Cryo DMG Area</cryo>.<br/>"],"4":"<br/>","5":"<i>\"Badai salju memenuhi pikiran sang bangau, sedang rasa iba yang berat membebani hatinya.\"</i>"},"param":["DMG Tebasan","DMG Saat Mekar","Durasi","Cooldown","Konsumsi Energy","","","","","","","","","","",""]},"5":{"name":"Amatsumi Kunitsumi Sanctification","field":{"0":"Setelah menggunakan <strong>Kamisato Art: Hyouka</strong>, meningkatkan 30% DMG Normal dan Charged Attack Kamisato Ayaka selama 6 detik."},"param":{}},"6":{"name":"Kanten Senmyou Blessing","field":{"0":"Jika efek Cryo di akhir <strong>Kamisato Art: Senho</strong> mengenai musuh, Kamisato Ayaka akan mendapatkan efek berikut:<br/>","1":["Memulihkan 10 Stamina<br/>","Mendapatkan 18% <cryo>Cryo DMG Bonus</cryo> selama 10 detik."]},"param":{}},"7":{"name":"Fruits of Shinsa","field":{"0":"Saat membuat Material Ascension Senjata, memiliki 10% kemungkinan untuk mendapatkan hasil 2 kali lipat."},"param":{}}},"constellation":{"0":{"0":"Saat Normal atau Charged Attack Kamisato Ayaka mengakibatkan <cryo>Cryo DMG</cryo> pada musuh, memiliki 50% kemungkinan untuk mengurangi 0,3 detik CD skill <strong>Kamisato Art: Hyouka</strong>. Efek ini dapat terpicu setiap 0,1 detik."},"1":{"0":"Melancarkan <strong>Kamisato Art: Soumetsu</strong> akan menciptakan 2 Frostflake Seki no To tambahan yang lebih kecil. Masing-masing akan mengakibatkan DMG sebesar 20% dari Frostflake Seki no To asli."},"2":{"0":"Meningkatkan 3 level <strong>Kamisato Art: Soumetsu</strong>.<br/>","1":"Maksimum: Lv. 15."},"3":{"0":"Mengurangi 30% DEF musuh yang terkena serangan Frostflake Seki no To dari skill <strong>Kamisato Art: Soumetsu</strong> selama 6 detik."},"4":{"0":"Meningkatkan 3 level <strong>Kamisato Art: Hyouka</strong> .<br/>","1":"Maksimum: Lv. 15."},"5":{"0":"Setiap 10 detik, Kamisato Ayaka akan mendapatkan efek \"Usurahi Butou\" yang meningkatkan DMG Charged Attack Ayaka sebesar 298%. Efek Usurahi Butou ini akan hilang 0,5 detik setelah Charged Attack mengenai musuh dan perhitungan waktu akan diulang kembali."}}}