{"talent":{"0":{"name":"Shuumatsuban Ninja Blade","field":{"0":{"0":"<strong>Normal Attack</strong><br/>","1":"Melancarkan hingga 4 tebasan berturut-turut."},"1":{"0":"<strong>Charged Attack</strong><br/>","1":"Terus menguras Stamina untuk melancarkan serangan berputar yang mengakibatkan DMG ke musuh di sekitar.<br/>","2":"Diakhiri dengan sebuah tebasan yang kuat."},"2":{"0":"<strong>Plunging Attack</strong><br/>","1":"Menerjang dari udara untuk menghantam tanah, menyerang musuh di jalur terjangan dan mengakibatkan DMG Area saat mendarat."}},"param":["DMG Tahap 1","DMG Tahap 2","DMG Tahap 3","DMG Tahap 4","DMG Berputar Charged Attack","DMG Akhir Charged Attack","Konsumsi Stamina Charged Attack","Durasi Maksimum","DMG Selama Plunging","DMG Plunging Attack Rendah/Tinggi","","","","","",""]},"1":{"name":"Yoohoo Art: Fuuin Dash","field":{"0":"Teknik spesial Ilmu Ninja Yoohoo yang menggunakan kecepatan angin untuk menyapu medan pertempuran.<br/>","1":"Melingkar menjadi Fuufuu Windwheel dan menabrak musuh dengan kecepatan tinggi, mengakibatkan <anemo>Anemo DMG</anemo>, dan saat durasi skill berakhir, melancarkan Fuufuu Whirlwind Kick yang mengakibatkan <anemo>Anemo DMG Area</anemo>.<br/>","2":"<br/>","3":"<strong>Tekan</strong><br/>","4":"Memasuki status Fuufuu Windwheel, dan berputar ke depan dengan jarak pendek, sebelum kemudian melancarkan serangan Fuufuu Whirlwind Kick.<br/>","5":"<br/>","6":"<strong>Tahan</strong><br/>","7":"Memasuki status Fuufuu Windwheel dan berputar terus menerus seperti roda, yang meningkatkan ketahanan Sayu terhadap interupsi selama berputar.<br/>","8":"Selama durasi, Sayu dapat mengontrol arah putaran dan dapat menggunakan skill ini sekali lagi untuk mengakhiri status Fuufuu Windwheel, yang mana akan melancarkan serangan Fuufuu Whirlwind Kick yang lebih kuat.<br/>","9":"Dalam mode Tahan, skill ini dapat memicu Elemental Absorption.<br/>","10":"<br/>","11":"Durasi skill maksimum adalah 10 detik, dan skill ini akan segera memasuki CD setelah efeknya berakhir. Semakin lama Sayu berada dalam status Fuufuu Windwheel, maka semakin lama durasi CD skill ini.<br/>","12":"<br/>","13":"<strong>Elemental Absorption</strong><br/>","14":"Selama berada dalam status Fuufuu Windwheel, jika Sayu bersentuhan dengan <hydro>Hydro</hydro>/<pyro>Pyro</pyro>/<cryo>Cryo</cryo>/<electro>Electro</electro>, maka Sayu akan mengakibatkan DMG elemental tambahan yang sesuai dengan elemen tersebut.<br/>","15":"Elemental Absorption hanya dapat terpicu sekali setiap kali skill digunakan.<br/>","16":"<br/>","17":"<i>Sayu dapat melakukan skill ini dengan mata tertutup. Teknik ini awalnya diciptakan untuk melarikan diri. Namun dengan Vision yang dimilikinya sekarang, Sayu akhirnya dapat berputar dan membuat musuh-musuhnya tak berkutik.</i>"},"param":["DMG Fuufuu Windwheel","DMG Fuufuu Whirlwind Kick Mode Tekan","DMG Fuufuu Whirlwind Kick Mode Tahan","DMG Elemental Fuufuu Windwheel","DMG Elemental Fuufuu Whirlwind Kick","Durasi Maksimum (Mode Tahan)","Cooldown","","","","","","","","",""]},"3":{"name":"Yoohoo Art: Mujina Flurry","field":{"0":"Teknik spesial lain dari Ilmu Ninja Yoohoo! Teknik ini dapat memanggil bala bantuan untuk Sayu.<br/>","1":"Mengakibatkan <anemo>Anemo DMG</anemo> terhadap musuh di sekitar dan memulihkan HP seluruh anggota party di sekitar. Jumlah HP yang dipulihkan berdasar pada ATK Sayu. Skill ini kemudian akan memanggil sebuah Muji-Muji Daruma.<br/>","2":"<br/>","3":"<strong>Muji-Muji Daruma</strong><br/>","4":"Muji-Muji Daruma akan melakukan salah satu tindakan berikut secara berkala berdasarkan situasi di sekitar:<br/>","5":["Jika semua Karakter di sekitar medan pertempuran memiliki HP lebih dari 70%, Daruma ini akan menyerang musuh di sekitar dan mengakibatkan <anemo>Anemo DMG</anemo>.<br/>","Jika di sekitar medan pertempuran ada Karakter dengan HP lebih rendah atau sama dengan 70%, Daruma ini akan memulihkan Karakter yang persentase HP-nya paling rendah, jumlah pemulihan berdasar pada ATK Sayu. Jika tidak ada musuh di sekitar dan HP Karakter lebih tinggi dari 70%, maka Daruma tetap akan memulihkan HP Karakter.<br/>"],"6":"<br/>","7":"<i>Orang biasa yang tidak mengerti ninjutsu sangat berharap agar Sayu dapat memperlihatkan lebih banyak kemampuannya, dan ada juga orang-orang yang ingin belajar darinya. Namun Sayu hanya ingin tidur dan tidak mau diganggu.</i>"},"param":["DMG Melancarkan Skill","Pemulihan Saat Melancarkan Skill","DMG Muji-Muji Daruma","Pemulihan Muji-Muji Daruma","Durasi","Cooldown","Konsumsi Energy","","","","","","","","",""]},"4":{"name":"Someone More Capable","field":{"0":"Saat Sayu berada di medan pertempuran dan memicu reaksi Swirl, Sayu akan memulihkan 300 HP untuk anggota party dan kawan yang ada di sekitar. Sayu juga akan memulihkan 1,2 HP tambahan untuk setiap poin Elemental Mastery yang dimiliki Sayu.<br/>","1":"Efek ini hanya dapat terpicu setiap 2 detik."},"param":{}},"5":{"name":"No Work Today!","field":{"0":"Muji-Muji Daruma yang tercipta dari <strong>Yoohoo Art: Mujina Flurry</strong> akan memberikan efek berikut:<br/>","1":["Saat memulihkan HP Karakter, HP Karakter yang di sekitar juga akan dipulihkan sebanyak 20%;<br/>","Meningkatkan cakupan area DMG saat menyerang musuh."]},"param":{}},"6":{"name":"Yoohoo Art: Silencer's Secret","field":{"0":"Saat Sayu berada di dalam party, Crystalfly dan beberapa binatang tertentu yang didekati Karakter dalam party tidak akan kaget dan kabur.<br/>","1":"Silakan menuju bagian Arsip > Makhluk Hidup/Hewan Liar > Lainnya untuk mengecek objek-objek yang dapat dipengaruhi skill ini."},"param":{}}},"constellation":{"0":{"0":"Muji-Muji Daruma yang diciptakan oleh <strong>Yoohoo Art: Mujina Flurry</strong> akan mengabaikan batas HP dan bisa menyerang musuh terdekat serta memulihkan HP Karakter secara bersamaan."},"1":{"0":"<strong>Yoohoo Art: Fuuin Dash</strong> mendapatkan efek berikut:<br/>","1":["DMG dari Mode Tekan Fuufuu Whirlwind Kick meningkat 3,3%.<br/>","Saat Mode Tahan dikerahkan, dan berada dalam status FuuFuu Windwheel, DMG dari Fuufuu Whirlwind Kick kali tersebut meningkat 3,3% setiap 0,5 detik. DMG tambahan maksimum yang bisa didapat dari metode ini adalah 66%."]},"2":{"0":"Meningkatkan 3 level <strong>Yoohoo Art: Mujina Flurry</strong>.<br/>","1":"Maksimum: Lv. 15."},"3":{"0":"Setiap kali Sayu memicu reaksi Swirl, 1,2 Energy terpulihkan.<br/>","1":"Dapat terpicu setiap 2 detik."},"4":{"0":"Meningkatkan 3 level <strong>Yoohoo Art: Fuuin Dash</strong>.<br/>","1":"Maksimum: Lv. 15."},"5":{"0":"ATK dan Pemulihan HP dari Muji-Muji Daruma yang diciptakan dengan <strong>Yoohoo Art: Mujina Flurry</strong> milik Sayu juga akan bertambah sesuai Elemental Mastery Sayu. Setiap poin Elemental Mastery yang dimiliki Sayu akan memberikan efek berikut:<br/>","1":["Muji-Muji Daruma mengakibatkan DMG tambahan sebesar 0,2% ATK. DMG tambahan maksimum yang dapat diperoleh dari metode ini adalah 400% ATK.<br/>","Meningkatkan jumlah HP yang dipulihkan oleh Muji-Muji Daruma sebanyak 3 HP. Efek pemulihan tambahan yang dapat diperoleh dari metode ini adalah 6.000 HP."]}}}