{"talent":{"0":{"name":"Strike of Fortune","field":{"0":{"0":"<strong>Normal Attack</strong><br/>","1":"Melancarkan hingga 5 serangan berturut-turut."},"1":{"0":"<strong>Charged Attack</strong><br/>","1":"Mengonsumsi sejumlah Stamina untuk melancarkan dua tebasan pedang."},"2":{"0":"<strong>Plunging Attack</strong><br/>","1":"Menerjang dari udara untuk menghantam tanah, menyerang musuh di jalur terjangan dan mengakibatkan DMG area saat mendarat."}},"param":["DMG Tahap 1","DMG Tahap 2","DMG Tahap 3","DMG Tahap 4","DMG Tahap 5","DMG Charged Attack","Konsumsi Stamina Charged Attack","DMG Selama Plunging","DMG Plunging Attack Min./Maks.","","","","","","",""]},"1":{"name":"Passion Overload","field":{"0":"Bennett memusatkan seluruh gairah dan impiannya bertualang ke dalam pedang miliknya. Hasilnya berbeda-beda tergantung dari seberapa bersemangatnya dia...<br/>","1":"<br/>","2":"<strong>Tekan</strong><br/>","3":"Sebuah ayunan berapi yang cepat, mengakibatkan <pyro>Pyro DMG</pyro>.<br/>","4":"<br/>","5":"<strong>Tahan (Sesaat)</strong><br/>","6":"Saat ditahan, menghasilkan efek berbeda saat dilepaskan berdasarkan Level Charge.<br/>","7":["Charge Tahap 1: Mengayun dua kali, mengakibatkan <pyro>Pyro DMG</pyro> dan menghempas musuh.<br/>","Charge Tahap 2: Mengayunkan pedang 3 kali untuk mengakibatkan <pyro>Pyro DMG</pyro> yang besar, tapi serangan terakhir akan memicu ledakan yang menghempas musuh dan Bennett.<br/>"],"8":"Bennett tidak menerima DMG dari hempasan.<br/>","9":"<br/>","10":"<i>Serangan yang mengombinasikan impian dan gairah Bennett. Tapi gairah terkadang terlalu berlebihan, dan Pyro terkadang meledak.</i>"},"param":["DMG Tekan","DMG Charge Tahap 1","DMG Charge Tahap 2","DMG Ledakan","Cooldown","","","","","","","","","","",""]},"3":{"name":"Fantastic Voyage","field":{"0":"Bennett melakukan serangan melompat, mengakibatkan <pyro>Pyro DMG</pyro> dan menciptakan sebuah Inspiration Field.<br/>","1":"<br/>","2":"<strong>Inspiration Field</strong><br/>","3":["Jika HP karakter di dalam lingkaran kurang dari 70%, maka HP mereka akan terus pulih. Jumlah pemulihan tergantung dari Max HP Bennett.<br/>","Jika HP karakter di dalam lingkaran di atas 70%, dia akan mendapat Bonus ATK berdasarkan Base ATK Bennett.<br/>","Memberikan <pyro>elemen Pyro</pyro> kepada karakter di dalam Inspiration Field.<br/>"],"4":"<br/>","5":"<i>Regu Petualangan Benny selalu menemui bahaya yang tidak diduga saat bertualang. Bennett selalu berusaha meyakini para anggotanya bahwa itu adalah tanda \"petualangan seru yang penuh tantangan dan kejutan\".</i>"},"param":["DMG Skill","Regenerasi HP/dtk","Rasio Bonus ATK","Durasi","Cooldown","Konsumsi Energy","","","","","","","","","",""]},"4":{"name":"Rekindle","field":{"0":"Mengurangi 20% CD <strong>Passion Overload</strong>."},"param":{}},"5":{"name":"Fearnaught","field":{"0":"Saat berada di dalam area <strong>Fantastic Voyage</strong>, <strong>Passion Overload</strong> mempunyai efek berikut:<br/>","1":["CD berkurang 50%.<br/>","Bennet tidak akan terlempar karena efek Charge Level 2."]},"param":{}},"6":{"name":"It Should Be Safe...","field":{"0":"Ketika dikirim untuk melakukan ekspedisi di Mondstadt, waktu yang dibutuhkan berkurang 25%."},"param":{}}},"constellation":{"0":{"0":"Efek peningkatan ATK dari <strong>Fantastic Voyage</strong> tidak lagi dibatasi HP, dan memiliki 20% ATK lebih besar."},"1":{"0":"Saat HP Bennett kurang dari 70%, meningkatkan 30% Energy Recharge."},"2":{"0":"Meningkatkan 3 level <strong>Passion Overload</strong>.<br/>","1":"Maksimum: Lv. 15."},"3":{"0":"Mendapatkan serangan tambahan dengan menggunakan Normal Attack saat Bennett melakukan serangan kedua dari skill <strong>Passion Overload</strong> Charge Level 1.<br/>","1":"Serangan tambahan menghasilkan 135% dari DMG serangan kedua."},"4":{"0":"Meningkatkan 3 level <strong>Fantastic Voyage</strong>.<br/>","1":"Maksimum: Lv. 15."},"5":{"0":"Memberikan 15% <pyro>Pyro DMG Bonus</pyro> dan <pyro>Pyro Infusion</pyro> pada karakter yang menggunakan Sword, Claymore dan Polearm di dalam radius <strong>Fantastic Voyage</strong>."}}}